[
{"text": "Architectural Designer", "date": "2020-01-23 11:37", "compensation": "$70,000 per year plus benefits", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-designer/7061525634.html", "address": ["\n        ", "\nPrepare space planning, construction drawing, and interior/conceptual design documents and presentations based on project requirements, presenting technical aspects to supervisory architects and clients to gain project approval. Use AutoCAD 2D tools including XRef effectively to draft design drawings, construction drawings and details. Modify and update designs based on review comments from peer architects and clients.  Evaluate site conditions and constraints for construction projects. Liaise with mechanical, electrical, and plumbing (MEP) engineers and with contractors.  $70,000 per year.  ", "\n", "\nRequirements:  Requires Bachelor’s degree in Architecture or foreign equivalent degree plus 24 months of experience in the job offered or as Project Architect.  24 months of experience with AUTOCAD 2D tools including XRef, Preparation of space planning, construction drawing, and interior/conceptual design documents, and Liaison with MEP Engineers.", "\n    "], "images": [], "type": "full-time"},
{"text": "Midsize Architectural firm seeks Graduates", "date": "2020-01-20 01:20", "compensation": "Payment per experience", "link": "https://newyork.craigslist.org/que/egr/d/flushing-midsize-architectural-firm/7059372984.html", "address": ["\n        ", "\nMidsize Architectural firm in Queens seeking architectural and Engineering  college students  graduates for internship, paid internships and for Permenant employment possibilities. Chinese speaking is a plus.", "\nAll applicants welcome.    "], "images": [], "type": "contract"},
{"text": "Junior Architect/ Intern", "date": "2020-01-20 08:39", "compensation": "hourly", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-intern/7059436981.html", "address": ["\n        ", "\nSmall Architectural / Interior Design firm located in the Lower East Side, specializing in residential and commercial projects, seeks an architectural intern. Work will consist of assisting in all phases of schematic design, design development, preparation of DOB/ LPC drawings and applications, construction documents, construction site visits, archiving, material sourcing, specifications, presentations and general office activities. ", "\n", "\nCandidates must be highly motivated, quick learners, with a passion for architecture and desire to learn and grow. Excellent AutoCAD drafting abilities and 3D rendering skills are a must. Candidates must be responsible, organized, punctual, reliable, have good communication skills, and be team-players, capable of multi-tasking and focused on producing accurate results.  ", "\n ", "\nPlease send:", "\n", "\n1.\tpdf samples of your work and include a brief description of your role in the work presented", "\n2.\ta cover letter and your resume ", "\n3.\tindicate your availability", "\n4.\tindicate your hourly fee requirements", "\n    "], "images": [], "type": "part-time"},
{"text": "Project Architect(s)", "date": "2020-01-20 11:06", "compensation": "Commensurate with Experience", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/7059531617.html", "address": ["\n        ", "\nMssa, a Small Successful 8-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "], "images": ["https://images.craigslist.org/00t0t_cKy4qK42TWe_600x450.jpg", "https://images.craigslist.org/00c0c_bJswHq7lLgP_600x450.jpg", "https://images.craigslist.org/00a0a_hIZ1YdnqmFE_600x450.jpg", "https://images.craigslist.org/00U0U_9vpU49N0i2v_600x450.jpg", "https://images.craigslist.org/01717_fVJHVM0ibdj_600x450.jpg", "https://images.craigslist.org/00v0v_gBDh9tWAfHx_600x450.jpg", "https://images.craigslist.org/00B0B_2bvEv2oHArx_600x450.jpg"], "type": "full-time"},
{"text": "Architectural Draftsman AutoCAD", "date": "2020-01-22 12:48", "compensation": "Based upon experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-draftsman-autocad/7060945815.html", "address": ["\n        ", "\nBoutique architectural firm in Soho specializing in high end residential seeks a team member to assist with design development and construction documents of city and country residential projects.", "\nBasic requirements:", "\nBachelor degree from accredited architecture school", "\nAutoCAD", "\nAdobe Suite (Photoshop, Illustrator, InDesign)", "\nMicrosoft Office (Word, Excel, Outlook)", "\nKeen design sensibility", "\nWork well within a team ", "\nEnglish fluency", "\nCitizen, Green Card, or Work Permit required", "\n", "\nThe position shall initially be hourly upon 90 day review.", "\n", "\nPlease send a letter of interest, resume, examples of your work, and salary expectations.", "\n    "], "images": [], "type": "contract"},
{"text": "HVAC Design Engineer with 5 Years Design Experience in US", "date": "2020-01-22 18:34", "compensation": "Salary negotiable based on experience.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-hvac-design-engineer-with-5/7061199900.html", "address": ["\n        ", "\nMidtown Consulting Engineering Office is looking for a Mechanical Engineer with minimum 5 years US Design Experience in HVAC Systems, Boiler Plants, Ventilation Systems, and Familiarity with NYC Building Codes. ", "\n", "\nExperience with AutoCAD is a plus.", "\n", "\nThis is a full time position. Working on long term contracts. ", "\n", "\nSalary negotiable based on experience.    "], "images": [], "type": "full-time"},
{"text": "Senior Project Manager", "date": "2020-01-22 18:05", "compensation": "Based on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-senior-project-manager/7061182401.html", "address": ["\n        ", "\nEstablished company with over 500 employees is seeking a project manager for recurring construction projects throughout Manhattan.  Includes steady salary, benefits and bonus potential.  Must have at least 10 years of experience in the construction industry and have familiarity with commercial construction.  Time will be allocated 80% to field operations and 20% office/administrative work. ", "\n", "\nRequired Bachelors Degree. ", "\n", "\nProficient in Microsoft applications and reading/reviewing construction plans.  Understanding Gantt Charts and other construction related software is helpful.   ", "\n", "\nPlease submit your resume in confidence.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural Senior Drafter/Job Captain", "date": "2020-01-23 08:55", "compensation": "salary commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-senior-drafter/7061419406.html", "address": ["\n        ", "\nSBLM New York is looking for a highly motivated Senior Drafter/Job Captain who has a passion for understanding weather related problems that occur on existing older buildings.", "\n", "\n Responsibilities include, but not limited to: ", "\n Coordinate and develop construction documents", "\n Take on technically challenging issues with Project Manager", "\n Perform code and zoning analyses", "\n Review and redline drawings", "\n Oversee drafters as required", "\n Produce deliverables without requiring constant supervision", "\n Organize and lead site visits and surveys", "\n Conduct material research and meet with vendor as necessary, to understand", "\n materials and products", "\n Take initiative to complete work", "\n", "\n Requirements:", "\n Bachelor’s Degree in Architecture", "\n 3 or more years’ experience in an Architect’s office", "\n Must be proficient in AutoCAD, Revit and other applicable industry software", "\n General understanding of codes and zoning", "\n General knowledge of building details and construction administration ", "\n Experience working with exterior envelope", "\n Positive attitude and driven to succeed", "\n", "\n . Compensation and Benefits:", "\n• We offer an excellent benefit package", "\n• Benefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n• Salary commensurate with level of experience", "\n• Our company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n• Creative and innovative work environment", "\n .    "], "images": [], "type": "full-time"},
{"text": "Construction PM's, Supers, & Estimators needed....NYC", "date": "2020-01-22 16:42", "compensation": "competitive above market salary ranges", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-construction-pms-supers/7061126782.html", "address": ["\n        ", "\nOur clients, a couple of top construction company clients located here in the NYC tri-state area, are looking for quality senior professionals (PM's, Superintendents, and Estimators) to join their staff.......experience ranges from civil engineering projects to new construction projects to fitout /interior projects......a minimum of 10+ years of progressive construction exp is needed.........estimators with on-screen takeoff exp is an urgent need for long term temp to perm opportunities.....a strong track record of stable, top level performance is a must for all positions.......opportunities also exist for client positions outside the NYC tri-state region.......send resume in Word along with salary requirements......    "], "images": [], "type": "full-time"},
{"text": "Architect-Construction Administration-Revit | Multi Family Residential", "date": "2020-01-20 11:45", "compensation": "90-100K", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-construction/7059565287.html", "address": ["\n        ", "\nProject Manager | Construction Administration", "\n", "\nOur Client:", "\nNYC award winning architecture, design and planning firm that focuses upon sustainability and social responsibility.", "\n", "\nPosition Description:", "\nThis award winning firm is looking to add a PM to their team that has significant Construction Administration experience.  The PM will be working on various projects including multi-family residential and utility building projects.  Candidate should be proficient in the hands on use of Revit and have 6-15 years of similar professional experience. ", "\n", "\nRequired Education:", "\nBachelor of Architect or Master of Architecture", "\n", "\nSalary:", "\nUp to 100k", "\n", "\nBenefits:", "\nA full comprehensive benefit package is available.    "], "images": [], "type": "full-time"},
{"text": "Architect Administrator", "date": "2020-01-22 16:06", "compensation": "Competitive salary", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-administrator/7061101880.html", "address": ["\n        ", "\nEstablished Mid-sized NYC architectural firm is seeking an architect with excellent project administrative skills. The position requires competence in zoning, good planning ability, and extremely strong organizational skills. The architect’s prime responsibility is to assist the senior partner in executing and developing all initial projects.", "\n", "\nThe ideal candidate will:", "\n", "\n- Demonstrate strong leadership abilities", "\n- Possess excellent problem solving and decision-making skills", "\n- Thrive in a fast-paced environment and have the ability to multi-task", "\n- Be detailed-oriented, efficient, and adaptable to changing deadlines and priorities", "\n- Have strong organizational skills, communication skills, and project management skills", "\n- Demonstrate enthusiastic commitment to our team-focused environment", "\n- Must possess integrity and strive for excellence", "\n- Must be self-motivated.", "\n- Possess type A personality", "\n", "\nSkills & Qualifications:", "\n", "\n- Highly capable of managing projects", "\n- Proficient in Autocad, Sketch-up, Microsoft Word, Project, Outlook and Excel", "\n- Excellent design and visualization skills", "\n- Familiar with NYC regulatory environment, including codes, DOB and zoning requirements", "\n- 8 years minimum experience required", "\n- 5-year architecture degree", "\n    "], "images": [], "type": "full-time"},
{"text": "Cad Drafter - Architectural/Engineering background", "date": "2020-01-22 13:53", "compensation": "based on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/cad-drafter-architectural-engineering/7060999419.html", "address": ["\n        ", "\nArchitectural Engineering firm seeking a CAD drafter with ", "\nArchitectural background OR", "\nStructural/Civil engineering background ", "\n", "\nOverview:", "\n-Work with Project Manager & Design Team on all elements of drafting", "\n-AutoCAD detailing", "\n", "\nSkills Required:", "\nAutoCAD a MUST", "\nStructural software is a plus (RISA, etc.)", "\nMS Excel, Word, Outlook", "\nStructural knowledge is a must", "\nBuilding code knowledge is a plus", "\n", "\nPlease send resume in PDF format    "], "images": [], "type": "full-time"},
{"text": "Electrical Estimator", "date": "2020-01-20 12:37", "compensation": "Salary to be discussed at time of meeting", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-electrical-estimator/7059611716.html", "address": ["\n        ", "\nElectrical Estimator (Full time position)", "\n", "\nLooking for an experienced electrical estimator 7-10 years experience preferred", "\n", "\nExperience bidding Electrical, Generators, Fire Alarm, Tele Data backbone & horizontal, DAS systems, Security, BMS, Solar, Lighting retrofits, etc.", "\n", "\nExperience bidding high-rise, commercial, residential, and mixed use buildings, design builds, and low voltage projects ", "\n", "\nLighting estimating experience a plus", "\n", "\nOur Electrical Estimator will be responsible for calculating the cost of electrical construction by reviewing and evaluating available documents and developing accurate, competitive, and profitable bid proposals for a variety of New York City and/or New Jersey electrical projects. Responsibilities include but, are not limited to the following:", "\n", "\nReviews and evaluates project plans and specifications, bid documents, and other relevant project documents to identify what is needed for a project and to create a bid proposal.", "\n", "\nKnowledge of programs such as Excel, Word, Con Est and Accubid a plus", "\n", "\nMust be able to attend walkthrough meetings, scope projects, and develop estimate based on walkthrough", "\n", "\nSalary: To be discussed upon interview", "\nPlease send resume to email address below", "\n    "], "images": [], "type": "full-time"},
{"text": "Architect (3-5 Years Experience)", "date": "2020-01-06 09:56", "compensation": "Compensation will be competitive and will depend on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-3-5-years-experience/7050757914.html", "address": ["\n        ", "\nDowntown Manhattan architectural firm is seeking architect with a minimum 3-5 years experience. ", "\n", "\nRequirements:", "\n-Bachelor of Architecture or Master of Architecture degree", "\n-3-5 Years relevant work experience (including Construction Documents with AutoCAD)", "\n-Legal residency", "\n-Excellent communication and time management skills  ", "\n", "\nWe are currently working on a wide range of residential projects including renovations and new buildings.", "\n", "\nYou will work as part of our team. You must be detail oriented, hands on and ready for independence and responsibility. You will primarily work on preparing Construction Drawings on AutoCAD and assist in Construction Administration.", "\n", "\nPlease send cover letter, work samples and resume for consideration.    "], "images": [], "type": "full-time"},
{"text": "Project Manager/ Drafter", "date": "2020-01-20 13:39", "compensation": "Based upon experience $20 - $25 an hour", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-project-manager-drafter/7059667375.html", "address": ["\n        ", "\nArchitectural Sheet Metal and Grille company looking", "\n", "\nEmployment type: full-time", "\n", "\nDuties include but are not limited to preliminary review of bid packages, preparing proposals, take offs, analyzing drawings (blueprints), following up on RFIs, being a liaison between company and subcontractors, attend meetings and progress walk-throughs", "\n", "\nMust have experience drafting in construction or other related field. ", "\n", "\nMUST HAVE 2 years experience in the field, knowledge of construction software/ strong analytical and communication skills.", "\nMust be detail oriented and possess good customer service skills. Must work well with others, have good work ethic, be self motivated and a team player.    "], "images": [], "type": "full-time"},
{"text": "Project Architect", "date": "2020-01-20 14:28", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/que/egr/d/floral-park-project-architect/7059709686.html", "address": ["\n        ", "\nWe are a successful Queens based Architectural Firm and are looking for an individual with 5 to 15 years of professional practice in an Architect’s office.", "\nOur studio offers an opportunity to be involved in all phases of Project Development from Feasibility, Zoning and Building Code Analysis, to Design Development, Construction Documents, Consultant Coordination, Construction Administration and City Approvals to Project Close up.", "\n", "\nYou will be involved in a diverse array of project types including Commercial, Residential, Educational, Mixed-Use, New Buildings and Alterations. Our projects vary in size and complexity from Multi-Story new buildings to interior alterations. ", "\nRequirements", "\n• Professional degree in Architecture from an NAAB Accredited Program", "\n• Minimum 5-10 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures ", "\n• Perform Site visits ", "\n• Check submittals and respond to requests for information", "\n• Fluent in AutoCAD, Revit, SketchUp ", "\n• Fluent English", "\n• Strong work ethic and ability to work with others  ", "\n", "\nPlease submit your resume including work samples and limit to 5 MB.", "\nThis position offers excellent growth opportunity and a competitive salary. ", "\n", "\n", "\n", "\n    "], "images": ["https://images.craigslist.org/01313_gUVZg1hLhm7_600x450.jpg", "https://images.craigslist.org/00D0D_gxY3yJtckUF_600x450.jpg", "https://images.craigslist.org/00808_gizRyD7D661_600x450.jpg"], "type": "full-time"},
{"text": "Construction Estimator Required", "date": "2020-01-06 13:19", "compensation": "Depending on Skills and Experience", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-construction-estimator-required/7050926280.html", "address": ["\n        ", "\nAn established General Contacting Company based in Bronx NY is seeking an estimator to work as full time estimator. Ideal candidate would have sound knowledge and experience with city Projects . Should be familiar with estimating software . Must be able to do complete take offs and do the estimating and also prepare the proposals. Experience of construction field would be an advantage.    "], "images": [], "type": "full-time"},
{"text": "Use LEGO® to teach kids engineering concepts!", "date": "2020-01-06 11:55", "compensation": "$18.00/hour + excess drive time", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-use-lego-to-teach-kids/7050851562.html", "address": ["\n        ", "\nAre you a tinkerer? Do you enjoy taking things apart and then putting them back together? How about playing with LEGO®? Would you like to use a ridiculous amount of LEGO® materials to teach kids how the world works? If so, then this may be your dream job!\n", "\n", "\n", " is an educational enrichment company that introduces children in grades K-8 to STEM concepts using LEGO® components.\n", "\n", "\nWe are hiring additional smart, creative, dynamic LEGO® Engineering Instructors to join our team delivering our great programs throughout the NYC Metro area with highest current needs in Brooklyn, Bronx, Queens, Long Island/Nassau County, and Westchester. This part-time position includes teaching daily after-school programs during the school year with some weekend birthday parties or community events, and full day camp programs during the summer.\u2028\u2028\n", "\n", "\nBuckle up - this is hard work! Lugging 40 pound totes in and out of your car, leading excited kids through challenging projects, managing classroom conflicts, cleaning up all that LEGO® - ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", " We also pay a 3 hour daily class minimum rather than just the hour or so spent in the classroom.   \n", "\n", "\n\t", "\n", "\t\t\n", "\n", "\t\n", "\n", "\n", "\nVisit ", " to learn more about the job and submit your online application!\n", " \n", " \n", "\n", " \n", " \nFind us on Facebook: ", "\n", " \n", " \n**This organization is not affiliated with the LEGO® GROUP.**    "], "images": [], "type": "part-time"},
{"text": "Experienced Kitchen & Bath Designer Wanted", "date": "2020-01-06 14:21", "compensation": "Compensation: Base salary plus commission", "link": "https://newyork.craigslist.org/mnh/egr/d/experienced-kitchen-bath-designer-wanted/7050980899.html", "address": ["\n        ", "\nWe are a high end kitchen & bath showroom looking for a full time candidate with at least 5 years' experience in designing and selecting materials for kitchen and bathroom projects. ", "\nMust have experience is selling kitchen cabinets, tiles, shower systems and all the finish materials that are needed for a kitchen and bath remodeling (preferably in manhattan). ", "\n", "\nThe candidate must have strong skills with design software (20/20 and CAD is a must), Microsoft Office, and all other standard office equipment/software.", "\n", "\nPlease submit your resume with references and if your qualifications match our needs, we will contact you shortly.    "], "images": [], "type": "full-time"},
{"text": "Draftsman SolidWorks Programming CAD/CAM", "date": "2020-01-06 16:15", "compensation": "TBD, Based on experience. Full benefits package to follow.", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-draftsman-solidworks-programming/7051072493.html", "address": ["\n        ", "\nSolidWorks Draftsman Needed.  Entry level or experienced. We can train for Programming of CAM. Immediate hire, full time, 5 or 6 month position, that could lead to permanent employment. Mechanical Engineering a plus. Excel/Estimating a plus. Bronx designer and manufacturer of Displays. Close to Subway.", "\nSend resume, no cover letter needed.", "\n", "\nPrincipals only.    "], "images": [], "type": "full-time"},
{"text": "Architect 3-10 years' Experience", "date": "2020-01-06 15:00", "compensation": "Negotiable", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-3-10-years-experience/7051014069.html", "address": ["\n        ", "\nTerrence O'Neal Architect LLC and ACB Architects, now merged as Tonab Architecture PLLC, seek project manager-level individual for design and construction documents for varied projects for local universities, airport work, and K-12 schools. The ideal candidate will have the following qualifications:", "\n", "\n1. Accredited Degree in Architecture: B.Arch or M.Arch from a NAAB-accredited school.", "\n2. Knowledge of Revit is required", "\n3. 3-10 years' NYC experience minimum", "\n4. Ability to handle all phases from design through construction documents    "], "images": [], "type": "full-time"},
{"text": "Project Manager for Carpeting and Custom Area Rugs Showroom", "date": "2020-01-06 15:47", "compensation": "$50,000 to $100,000 per year commensurate with experience; 100% health coverage after 3 months and retirement benefits after one year.", "link": "https://newyork.craigslist.org/mnh/egr/d/project-manager-for-carpeting-and/7051051275.html", "address": ["\n        ", "\nThis is a full time position for an experienced Project Manager conducting inside sales for high-end commercial and residential floor covering, including carpeting and custom area rugs. Our showroom is in New York City near Union Square.", "\n", "\nThe successful candidate must posses a minimum of 5 years of experience working in high-end luxury sales, preferably working with architects, interior designers and general contractors.", "\n", "\nOther qualifications and requirements are:", "\n- understand urban commercial and residential living concepts, styles and designs.", "\n- proof-of-success includes references for 3 successful completed projects.", "\n- work in harmony with others in an open office environment.", "\n- read and understand a floor plan at ease and not intimidated by complex numbers.", "\n- excellent verbal and writing communication skills.", "\n", "\nThis is an ideal position for an architect, designer, general contractor who is interested in switching career path.", "\n", "\nTO APPLY, please reply via email with your resume and cover letter files attached (pdf, docx, or doc). Please do not copy and paste your information in the body of the email. To be considered, please indicate \"Project Manager\" in the subject line. ", "\nPlease visit aronsonsfloors.com to learn more about us.", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Drafter/Job Captain", "date": "2020-01-06 15:57", "compensation": "Competitive Salary - DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-senior-drafter-job-captain/7051059147.html", "address": ["\n        ", "\nSBLM New York is looking for a highly motivated Senior Drafter/Job Captain who has a passion for understanding weather related problems that occur on existing older buildings.", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters as required", "\nProduce deliverables without requiring constant supervision", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3 or more years’ experience in an Architect’s office", "\nMust be proficient in AutoCAD, Revit and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction administration ", "\nExperience working with exterior envelope", "\nPositive attitude and driven to succeed", "\n", "\n. Compensation and Benefits:", "\n•\tWe offer an excellent benefit package", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n•\tSalary commensurate with level of experience", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n•\tCreative and innovative work environment", "\n.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Senior Drafter/Job Captain in the subject. No phone calls, please", "\n    "], "images": [], "type": "full-time"},
{"text": "Intermediate Architect - Single-Family/Luxury Custom Homes", "date": "2020-01-06 17:38", "compensation": "Competitive based on years of experience and aligning projects", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect-single/7051134047.html", "address": ["\n        ", "\nNYC-based mid-sized firm is seeking a talented intermediate level architect with custom luxury residential project experience. This is a hands on full process design studio with potential for professional growth. Applicants should be personable, creative, and have great attention to detail. ", "\n", "\nRequirements:", "\n1. B.Arch/M.Arch or an equivalent professional Degree in Interior Design or Interior Architecture", "\n2. A minimum of 3 years of experience in a residential design/architecture position ", "\n3. Display a high level of technical knowledge in custom residential millwork ", "\n", "\nThis is a chance to work in a collaborative and relationship focused environment with local clients. You will have the ability to carry interesting high quality design projects from start to finish.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural Drafter", "date": "2020-01-07 11:49", "compensation": "salary commensurate with experience", "link": "https://newyork.craigslist.org/lgi/egr/d/huntington-station-architectural-drafter/7051517894.html", "address": ["\n        ", "\nSBLM Long Island branch office of NYC based Architectural firm seeks motivated and talented Junior through Senior Architectural Drafter (Architect in Training). ", "\n", "\nRequirements:", "\n•\tBA Arch or BS Arch degree required", "\n•\tAutoCAD required (basic test at interview) Revit a plus", "\n•\t2 to 7 years’ experience working in Architects office", "\n•\tExcellent communication skills with ability to work well under deadlines", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary, excellent benefits package and a creative, innovative work environment. ", "\n•\tOur benefits include Medical/Dental/Vision, 401K Plan, Personal Time Off, Paid Holidays, Flexible Spending Plans and more. ", "\n•\tCompany Culture: learning and growth opportunities, rewarding projects, free educational ongoing learning", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include “Architectural Drafter in subject line.  No phone calls, please.", "\n    "], "images": [], "type": "full-time"},
{"text": "Construction Estimator", "date": "2020-01-07 12:07", "compensation": "Negotiable", "link": "https://newyork.craigslist.org/que/egr/d/flushing-construction-estimator/7051532561.html", "address": ["\n        ", "\n-Position: Construction Estimator  (Office Location in Flushing/College Point Area)", "\n-Full Time Employment", "\n-Health Benefits Offered", "\n-Medium Size and Growing Construction Company ", "\n-Fully Operational General Contracting Office-All Resources to be Supplied to Estimator Including Tools/Programs as Needed to enhance job Performance", "\n", "\n1) General Construction Estimates to be performed including  jobs from $10,000-$25,000,000+", "\n    -From Minor Reno Work to Ground Up New Construction Work", "\n2) Construction Experience Necessary ", "\n3) Estimator Must have a good grasp of the Means and Methods of Construction", "\n4) 3+ Years Estimating Experience is a Plus", "\n5) Must be capable of producing scope sheets for sub contractors and leveling all GC and Sub Contractor Bids", "\n6)Experience in public entities is a plus.  SCA, NYCHA, Port Authority, MTA & Various Prevailing Wage Jobs", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Architect | Restaurant Architecture Firm", "date": "2020-01-07 12:29", "compensation": "Up to 110K, depending upon experience level and interview process.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-senior-architect-restaurant/7051552373.html", "address": ["\n        ", "\nTitle:Senior Architect - Project Manager | Restaurants", "\n", "\nCompany Description:", "\nCommercial Architecture + Design Firm that provides professional Architectural, Planning and Design services for restaurants and large retail projects.", "\n", "\nPosition Description:", "\nSenior Architect - Project Manager with 7 plus years of related experience working with restaurants or food and beverage projects to manage work on fine dining restaurants.Required:Bachelor of Architecture or Masters of Architecture.Project experience must include restaurants.Strong Project management skills.Strong AutoCAD skills.", "\n", "\nGREAT COMPENSATION BASED UPON AN ANNUAL SALARY PLUS BENEFITS AND PERKS", "\nImmediate In Person Interview and Immediate Hire. ", "\nCandidate must be currently authorized and eligible to work in the U.S. for any employer. ", "\nMust be available to begin work in two weeks from date of hire.    "], "images": [], "type": "full-time"},
{"text": "Floor Plan Measurer: AS-BUILT Drawings $50/hr (NY)", "date": "2020-01-07 13:16", "compensation": "$50 per hour plus $10 travel and $10 per diem", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-floor-plan-measurer-as/7051593870.html", "address": ["\n        ", "\nWe have an immediate opening for a floor plan measurer. This is a flexible position for part-time work (contractor). You will set your own schedule and we will fit appointments into your availability (M-F, 9-5 only). ", "\n", "\nApplicant must be highly experienced in creating as-built condition drawings (floor plans) of residential and commercial properties in CAD. Applicant must have the ability to create CAD drawings on-site using own laptop and AutoCAD software. Taking measurements on paper and later transferring to CAD drawings is NOT acceptable. Applicant must use a laser tape measure on-site.", "\n", "\nApplicant must:", "\n- Have a good understanding of building construction", "\n- Be highly-proficient in CAD", "\n- Have availability during normal weekday business hours: 9-5 to survey properties (please do not apply if you are looking for after-hour or weekend appointments.)", "\n- Have own vehicle to visit properties", "\n- Be reliable and very detail oriented", "\n", "\nThere are no set number of measurements in a day or week as appointments vary from week to week. We prefer a candidate with lots of availability but can set up as many or as few appointments as desired. This is a great, flexible opportunity for the right candidate.", "\n", "\nCompensation: $50 per hr plus $10 travel and $10 per diem", "\n", "\nPlease send email with your previous work experience and education. ", "\nYou must use the following subject line in your email: \"Re: Floor Plan Measurer - New York\"    "], "images": [], "type": "part-time"},
{"text": "Senior Mechanical Design Engineer", "date": "2020-01-07 13:23", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-senior-mechanical-design/7051599379.html", "address": ["\n        ", "\nSenior Mechanical Design Engineer must create and launch six product prototypes and related commercial versions. Senior Mechanical Design Engineer must design an additional three prototypes using Autodesk Inventor, AutoCAD and Autodesk CFD for 3D modeling product design related tasks.", "\nSenior Mechanical Design Engineer must optimize final manufacturing product costs by more than 25% by using python for SKU sizing optimization and use data modeling for ongoing optimization of product and processes. ", "\nIn the Research and Development phase of our business, Senior Mechanical Design Engineer oversees development of electrifying gas and oil boilers in NYC in partnership with National Grid & Columbia University. This will help to eliminate the use of fossil fuels for heating in the city and would improve air quality.  ", "\nSenior Mechanical Design Engineer performs ongoing modeling simulations of thermodynamic processes.", "\nIn the Product/Project Management phase of our business, Senior Mechanical Design Engineer manages relationships with manufacturers, and compiles functional and technical specifications including unique design specifications for various products. Senior Mechanical Design Engineer must also manage and review iterative feedback processes for manufacturing components.", "\nSenior Mechanical Design Engineer oversees and provides technical advice for the installation of large projects including the full retrofit of Providence public housing and Providence public schools in partnership with National Grid.", "\nDaily supervision of 2 subordinate Buildings Engineers; and 3 subcontractors.", "\nRequirements: Bachelor's Degree in Mechanical Engineering plus 1 year progressive postgraduate experience. Radiator Labs, Inc, New York City, NY. Resume to jobs@radiatorlabs.com    "], "images": [], "type": "full-time"},
{"text": "Interior Designer (Int/Sr)", "date": "2020-01-07 17:03", "compensation": "Competitive compensation commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-interior-designer-int-sr/7051770984.html", "address": ["\n        ", "\nArchitecture / Interior Design office located in the NYC Flatiron District specializing in the design of contemporary high-end custom home interiors. We are currently seeking a professional candidate to work directly with principal who is passionate about contemporary interior design, self-motivated, capable of handling multiple projects efficiently with minimum supervision. Must be creative, innovative, highly detailed-oriented, and have excellent analytical and problem-solving skills.", "\n", "\nResponsibilities:", "\n• Perform leadership role designing projects in all phases of design, from programming to contract administration;", "\n• Have a good understanding of interior finishes, materials, furniture, lighting, fixtures, and FF&E schedules and budgets for residential projects;", "\n• Prepare presentation boards, AutoCAD drawings (including electrical & lighting plans), elevations, renderings, specifications, purchase orders and invoices;", "\n• Manage the development of design from initial site measuring until final installations of FF&E;", "\n• Visit job sites to address and resolve construction/installation issues;", "\n• Schedule and conduct Client meetings to keep Clients current on proposed designs;", "\n• Review submittals, shop drawings, substitutions and field conditions for conformance with design intent;", "\n• Coordinate with outside team members such as contractors, vendors, workrooms and R&D companies;", "\n• Track project tasks for multiple projects simultaneously; keep track of invoices, budget and timelines;", "\n• Communicate with vendors, visit showrooms to select samples necessary for presentations.", "\n", "\nRequired Skills and Experience:", "\n• 3-4 years post-graduate design experience with large experience working in high-end residential interiors projects;", "\n• Bachelor's Degree in Interior Design or Architecture is a must. Master's Degree and/or NCIDQ are a plus;", "\n• Proficiency in AutoCAD, REVIT, Photoshop and Sketchup;", "\n• Excellent writing and communication skills;", "\n• Excellent organizational and teamwork skills, with meticulous attention to detail;", "\n• Must be proactive in anticipating Client questions;", "\n• US Citizen or have a current work visa for work in the US", "\n", "\nSalary: Competitive compensation commensurate with experience", "\n", "\nPlease Submit Resume and Work Samples    "], "images": [], "type": "full-time"},
{"text": "Architectural Drafter (Mid/Sr)", "date": "2020-01-07 16:50", "compensation": "Compensation Commensurate with Experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-drafter-mid-sr/7051762121.html", "address": ["\n        ", "\nArchitecture / Interior Design office located in the NYC Flatiron District specializing in the design of high end custom homes and luxury interiors. We are seeking an Intermediate to Senior Architectural Drafter to work in a small fast-paced office with the firm principal and staff preparing design development and construction drawing sets. Candidates for this position must exhibit a strong design sensibility and knowledge of construction systems and assembly. All candidates must demonstrate proficiency in AutoCad and Revit in all the preparation of 2D and 3D drawings and detailed construction documents including the ability to work on multiple projects and communicate effectively with clients & consultants. Candidates must also comprehend architectural redlines and efficiently produce documents and revisions.", "\n", "\nSpecific qualifications:", "\n• Professional or Graduate degree in Architecture (desired, not required) with at least 5 years professional experience", "\n• Detail oriented, efficient and adaptable to changing deadlines and priorities", "\n• Must be highly motivated and proactive in fast-paced environment", "\n• Ability to quickly absorb and utilize company-specific techniques, standards and procedures", "\n• AutoCAD & Revit Proficiency Required", "\n• Advanced Sketch-Up, 3D Rendering a plus", "\n• Proficiency in advanced BIM tools", "\n• Translate current AutoCAD standards to Revit", "\n• Strong written and verbal communication skills", "\n• Good interpersonal skills and able to work independently and as part of a team", "\n• Ability accurately measure and document existing conditions", "\n• Experience working on custom homes, retail & corporate offices", "\n• Knowledge of  NYC residential zoning a plus", "\n• Experience in Preparing NYC Department of Building Filing Sets a plus", "\n• US Citizen or have a current work visa for work in the US", "\n", "\nSalary: Competitive compensation commensurate with experience", "\n", "\nSubmit: Resume and Work Samples    "], "images": [], "type": "full-time"},
{"text": "Top Architectural Metal  + Glass Company looking for drafter/engineer!", "date": "2020-01-07 17:47", "compensation": "Negotiable, 401K, Profit Sharing.", "link": "https://newyork.craigslist.org/que/egr/d/woodside-top-architectural-metal-glass/7051801345.html", "address": ["\n        ", "\nWe are one of the top architectural metal and glass fabrication and installation companies in New York.  We work with fortune 500 company clients and the top architects in the city.  We are looking for an engineer that is proficient in CAD, understand construction processes and architectural details.  We are willing to train the right person.  You are self motivated, a problem solver and can work out vague details into something that can be built.   Join our team and enjoy a long term career opportunity, competitive pay and benefits.  Please send your resume along with some sample of your CAD work (the more detailed the better).    "], "images": ["https://images.craigslist.org/00M0M_8HIHzDOZRoT_600x450.jpg", "https://images.craigslist.org/00E0E_iVW1qK80rHj_600x450.jpg", "https://images.craigslist.org/01212_lOsSLJpoeZ3_600x450.jpg", "https://images.craigslist.org/00L0L_kAn5VHdl9Bd_600x450.jpg"], "type": "full-time"},
{"text": "Architectural Services_NYC DOB Commercial Filing set", "date": "2020-01-20 12:04", "compensation": "TBD", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-servicesnyc-dob/7059580986.html", "address": ["\n        ", "\nArchitectural Services_NYC DOB Commercial Filing set", "\n", "\nSeeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer at this given time but can turn into more    "], "images": [], "type": "employee's choice"},
{"text": "AutoCad is a requirement.......", "date": "2020-01-07 23:09", "compensation": "DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-autocad-is-requirement/7051948263.html", "address": ["\n        ", "\nBut if you know AutoCad and have a passion for interior designing and building....WE WILL TRAIN THE RIGHT CANDIDATE!!!", "\n", "\nThe Renovated Home, a boutique interior design/build firm specializing in high end residential design AND build, is seeking a talented junior architectural designer with exceptional design and communication skills for a full time design position with our team.", "\n", "\nWe are looking for a talented interior design | architectural graduate to learn all facets of the process of  interior designing and building residential projects.  Additionally helpful is prior experience in detail construction drawings, extensive material knowledge, M.E.P, lighting,", "\n", "\nCandidate must be a team player, energetic, motivated, highly organized and a positive attitude.", "\n", "\nRequirements:", "\n• Proficient in AutoCAD, Microsoft Office and Photoshop | Indesign", "\n• Strong verbal and written communication skills", "\n• All Applicants Must Be Qualified for U.S. Employment", "\n• Must be available ", "\n• Rendering and sketching skills are a plus", "\n• Interior construction detailing is a plus", "\n• Living within the 5 boroughs is pretty much a requisite as well.", "\n", "\nPlease send your resume along with your portfolio via email.    "], "images": [], "type": "full-time"},
{"text": "Drafter", "date": "2020-01-08 10:38", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/brooklyn-drafter/7052109003.html", "address": ["\n        ", "\nConstruction company specializing in exterior restoration will hire a draftsman/assistant. Basic knowledge of AutoCad necessary. Technical education a plus. We are willing to train the right candidate. Please send you resume.    "], "images": [], "type": "full-time"},
{"text": "Estimating Plan Clerk", "date": "2020-01-08 08:53", "compensation": "20.00 an hour", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-estimating-plan-clerk/7052045811.html", "address": ["\n        ", "\nMechanical Contractor specializing in HVAC construction, installation and maintenance for the NY Tri-State area is currently seeking a qualified candidate to fill the role of a Plan Clerk on a full time basis. The Plan Clerk will report directly to the Director of Estimating. The Plan Clerk will be responsible in receiving and reviewing documents in regards to estimating, managing electronically stored files and following up on document changes. The job is heavily dependent on computer usage, you will be responsible in obtaining, sorting all plan documents for the company.", "\n", "\nDescription:", "\n", "\nPlan Clerk will receive and review all request for proposals from clients.", "\nWork with estimators to develop and manage an estimating schedule.", "\nObtain pricing from vendors and suppliers and subcontractors.", "\nEnsure the estimating team has up to date information.", "\nMaintain, update, and organize all electronic files including hard copies.", "\nAssist in the preparation of proposals and bid folders", "\nFollow-up on bids and estimates", "\nResponsible for obtaining drawings for bidding purposes.", "\n", "\nQualification:", "\n", "\nMinimum 1 year experience in a construction company", "\nAbility to multi-task, work in a fast pace environment.", "\nStrong organization skills.", "\nExcellent verbal and written communication skills.", "\nShould be well versed in computer usage and software such as Microsoft Office and Building Connected.", "\n", "\nOur Company offers:", "\n", "\nMedical / Dental / Vision", "\n401(k)", "\nPaid Time Off", "\nEmployee Stock Ownership Plan", "\n", "\nThe above statements are intended to describe the general nature and level of work performed by people assigned to this classification. They are not intended to be a complete list of all responsibilities, duties and skills required of personnel so classified. Duties and responsibilities may be added or changed as deemed appropriate by management at any time.", "\n", "\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, national origin, sexual orientation, age, sex, predisposing genetic characteristics, marital status, domestic violence victim status, disability or military status.    "], "images": [], "type": "full-time"},
{"text": "Junior Architect", "date": "2020-01-08 10:49", "compensation": "Commensurate with Experience", "link": "https://newyork.craigslist.org/wch/egr/d/mamaroneck-junior-architect/7052115955.html", "address": ["\n        ", "\nKeller/Eaton Architects, PC is an award winning, high-end residential architectural and interior design firm in Mamaroneck, NY. We are seeking a talented and motivated individual to join our team to help create amazing spaces. Position is full time, with competitive salary and benefits. ", "\n", "\nQualifications: ", "\n", "\n-Bachelor of Architecture from an accredited institution.", "\n-Ability to work independently and collaboratively in a team environment.", "\n-Willingness to multi-task, work on many different projects and meet project deadlines.", "\n-Clear and concise written and verbal communication skills.", "\n-Efficient drafting skills with particular attention to detail and line weight.", "\n-Experience/interest in residential architecture a plus.", "\n-Positive attitude and driven to learn/succeed.", "\n-An outgoing personality…zombies need not apply.", "\n-Proficiency in Autocad", "\n-Experience in Photoshop/3-D modeling a plus.", "\n", "\nSalary commensurate with experience.", "\n", "\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.", "\n", "\nFor examples of our work or to learn more about the firm, please visit www.rkdea.com.", "\n", "\nPlease email your resume, work samples and salary requirements. No phone calls please.", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Architect(s)", "date": "2020-01-08 11:11", "compensation": "Commensurate with Experience", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/7052133030.html", "address": ["\n        ", "\nMssa, a Small Successful 8-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "], "images": ["https://images.craigslist.org/00q0q_j3yUmHZgn3i_600x450.jpg", "https://images.craigslist.org/00Q0Q_lOrCMRAjq24_600x450.jpg", "https://images.craigslist.org/00u0u_4FxJckhY6el_600x450.jpg", "https://images.craigslist.org/00c0c_bJswHq7lLgP_600x450.jpg"], "type": "full-time"},
{"text": "Construction Inspector / Special Inspector", "date": "2020-01-08 13:28", "compensation": "The salary is based on level of experience.", "link": "https://newyork.craigslist.org/que/egr/d/flushing-construction-inspector-special/7052245997.html", "address": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking an inspector to join our team to perform special inspection on New York City construction projects.", "\n", "\nDuties and Responsibilities:", "\n- Review construction documents and shop drawings.", "\n- Perform special inspection for residential and commercial buildings in New York City.", "\n- Prepare reports on inspection activities, file documentation and complete required technical report forms in accordance with New York City Building Codes.", "\n- Coordinate with owners, contractors, and engineers.", "\n", "\nSkills and Qualifications:", "\n- High School Diploma is required. Bachelor’s degree or higher is preferred.", "\n- 3+ years of related work experience as a construction or special inspector.", "\n- Holding and/or be able to obtain the required ICC certification within three months of hire.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n    "], "images": [], "type": "full-time"},
{"text": "Junior/Intermediate Architect - Immediate Hire", "date": "2020-01-08 12:13", "compensation": "Competitive based on years of experience and aligning projects", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-junior-intermediate/7052181141.html", "address": ["\n        ", "\nWant to make a difference in New York City? NY based practice and advocate for sustainable design, is seeking a positive energy Junior and Intermediate Architect to work in a collaborative environment directly with owner. Work includes client-facing full process architecture design. Seeking an individual who shares the same approach to sustainable design. ", "\n", "\nMinimum Requirements:", "\n1. Bachelor's and/or Master's Degree in Architecture", "\n2. 1+ year of professional experience within an Architecture practice", "\n3. Full CD production knowledge in Revit", "\n4. Experience in NYC Building Codes/Zoning a plus    "], "images": [], "type": "full-time"},
{"text": "Construction Project Manager", "date": "2019-12-24 08:21", "compensation": "TBD", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-project-manager/7043837300.html", "address": ["\n        ", "\nPrepare complete and detailed scopes of work for construction trades.", "\n", "\nPerform quantity take-offs with accuracy and completeness.", "\nSolicit budgets and bids from subcontractors and suppliers in a timely fashion", "\nResolves cost discrepancies by collecting and analyzing information.", "\nPrepares special reports by collecting, analyzing, and summarizing information and trends.", "\nMonitor project costs and schedule", "\nMonitor site supers and attend meetings", "\n", "\nAt least 4 years industry experience minimum", "\n", "\nPlease email resume with expected salary", "\n", "\nAlso looking for Estimators and Assistant Project managers/site supers    "], "images": [], "type": "full-time"},
{"text": "Career Opportunities in Engineering for Immigrant Professionals", "date": "2019-12-24 13:07", "compensation": "Free Training with Job Placement Assistance", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-career-opportunities-in/7043969868.html", "address": ["\n        ", "\nThe Cooper Union Retraining Program for Immigrant Engineers at CAMBA assists highly skilled immigrant professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering. Courses are scheduled around the needs of working professionals and offered evenings and weekends. ", "\nSince its inception in 1987, the Retraining Program helped connect more than 5,000 immigrant professionals to science, technology and engineering jobs. ", "\nALL SERVICES ARE FREE", "\nClasses include:", "\nOSHA 30", "\nGreen Building Guidelines & Environmental Safety", "\nBuilding Operation, Maintenance & Safety Regulation", "\nHeating, Ventilation, Air-Condition and Safety Regulation (HVAC)", "\nNational Electrical Code (NEC) and Its Applications", "\nAISC Structural Steel Design", "\nACI Structural Concrete Design", "\nIntroduction to AutoCAD for Engineers", "\nAdvanced AutoCAD and Revit", "\nBuilding Cost Estimating and Bridge, Highway, Railroad Engineering", "\n", "\nTo be considered for the program applicants must:", "\n", "\n•Be born outside of the United States", "\n•Be authorized to work in the United States", "\n•Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not in US)", "\n•Have lived in the U.S. less than five full years. (Exceptions for those in the U.S. more than five years may be made on a case-by-case basis)", "\n•Be unemployed, underemployed, or working in a field not related to your education", "\n•Have intermediate+ English fluency", "\n•Demonstrate a financial need", "\n•Be highly motivated to pursue professional job search", "\n", "\nPlease, visit our web site: www.cooper.edu/immigrant-retraining for application instructions and for more information call 718-226-0437.", "\n    "], "images": [], "type": "full-time"},
{"text": "CONSTRUCTION SUPERINTENDENT up to 110k year/DOB LICENSE REQUIRED", "date": "2019-12-24 16:28", "compensation": "payment per building/ up to 10 buildings", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-superintendent-up/7044059593.html", "address": ["\n        ", "\nWe are looking for a Construction Superintendent with DOB License and 62Hours Site Safety Training (SST).", "\n", "\nJob Description:", "\n• Visit up to 10 job sites to ensure safety per DOB and OSHA standards.", "\n• Maintain daily paperwork such as logbooks, field safety checklists.", "\n• Review and analyze detailed construction drawings.", "\n• Communicate with competent persons, clients, GCs regarding safety requirements.", "\n• When necessary communicate with DOB inspectors regarding safety issues.", "\n", "\nQualifications/Requirements:", "\n• Minimum 5 years’ experience in general construction", "\n• DOB Construction Superintendent license", "\n• DOB 62Hours Site Safety Training (SST) Card", "\n• Proficiency in reading plans, blueprints, specifications", "\n• Knowledge of DOB building codes and NYC Construction Codes", "\n• Ability to professionally deal with NYC DOB Inspectors", "\n• Strong communication skills and computer literacy", "\n• Excellent problem-solving skills  ", "\n• Sound judgment and ethical conduct", "\n", "\nAdditional requirements:", "\nDriver's License (Required)", "\nPersonal vehicle (Required)", "\n    "], "images": [], "type": "contract"},
{"text": "HVAC Engeenier", "date": "2019-12-24 20:39", "compensation": "Contract", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-hvac-engeenier/7044121856.html", "address": ["\n        ", "\nWe need engineer to draw the plans and add all the required details as per NYC codes so we can get the plans approved by the management and board, and than file woth DOB", "\n its apartment on the first floor and we need to run the duct work and install units and required.", "\nPls respond with your experience and if did any work in Manhattan!", "\n", "\nThank you    "], "images": [], "type": "part-time"},
{"text": "JUNIOR/INTERMEDIATE PROJECT ARCHITECT : 2-5 yrs Exp", "date": "2019-12-26 09:52", "compensation": "Salary plus healthcare benefits", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-intermediate/7044505286.html", "address": ["\n        ", "\nWe are currently seeking a Jr./Intermediate Project Architect with 2-5 years experience to join our team.", "\n", "\nFor 28 years, Joseph Vance Architects has been designing high end, custom residential projects - brownstone/townhouse gut renovations, ground up townhouses, lofts and rooftop additions. We are a small group of creative problem solvers with a taste for well-crafted design. We value hard work to continuously grow and evolve, pushing boundaries until a project is the best it can be.", "\n", "\nCurrent projects include a ground up new 6 story townhouse in the Upper West Side (with a new basketball court beneath), a gut renovation of a townhouse in Chelsea including a totally new facade, a 6,000sf triplex in a new West Village development, and others.", "\n", "\nAs a member of our team, you will work with senior staff and the Principal to execute residential projects. You will gain experience in generating designs, presentations and drawings, researching codes, managing schedules, and coordinating with clients, contractors, expeditors, city agencies, vendors, consultants, etc. throughout the entire process of the project from initial client meetings to punch-list closeout. The nature of our business requires immense organization, efficiency, and commitment, but we also maintain a very stable work/life balance.", "\n", "\nIdeally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, have worked with 3D modeling/BIM software and the adobe creative suite. We also expect you to have a great design sensibility and critical thinking skills, along with 2-5 years of professional experience.", "\n", "\nIf this sounds like you, then please submit a pdf of your cover letter, resume, and work sample. This is a full time salaried position with medical coverage (no part-time or freelance work). We look forward to hearing from you and appreciate your interest in our firm!", "\n", "\nThis is a full time salaried position with benefits (no part-time or freelance positions). Qualified candidates are currently living in the tri-state area and should submit a resume, work samples and salary requirements via .pdf.    "], "images": [], "type": "full-time"},
{"text": "Architectural Drafter", "date": "2019-12-26 09:38", "compensation": "Depends on experience. (starts at $22 hour)", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-drafter/7044497882.html", "address": ["\n        ", "\nAt AJC Design, Creativity is Everything! We are a hospitality and residential interior design firm based in New York City with an ever-growing list of hospitality and residential clients nationally. We are seeking a talented interior/architectural drafter with strong AutoCAD skills to work closely with our design team through all phases of our design process such as concept, schematic, design development, and construction management, including the creation of construction documents and review of submittals and RFI, aligned with the AJC Design brand.", "\n", "\nPrimary responsibilities include: ", "\n•\tGenerate shop drawings, floor plans, elevation details, and schedules", "\n           using automated software such as AutoCAD and Revit; make revisions as needed", "\n•\tAssemble and develop construction document sets", "\n•\tConduct research into supplier and materials to ensure projects are on-budget", "\n•\tPerform a detailed redline review of all blueprints, design and construction estimates, and project information sheets ", "\n•\tReview RFI and submittals during the construction administrative process", "\n", "\nIs This You? ", "\n•\tYou have an Interior Design, Architecture or related degree", "\n•\tYou have 5+ years of experience as an architectural/interior designer or drafter", "\n•\tYou have 1+ years of experience working in the hospitality industry", "\n•\tYou have strong design skills, knowledge of local building codes and technical aptitude (i.e., highly proficient with MS Office, AutoCAD and Revit, other 3D modeling tools)", "\n•\tYou know how to produce, track and revise shop drawings, drawing submittals & RFI as they occur", "\n•\tYou have the ability to manage projects from start to finish with minimal supervision", "\n•\tYou have excellent communication skills, are comfortable presenting to clients and are open to feedback", "\n•\tYou have the ability to handle a fast-paced environment and are self-motivated to meet deadlines", "\n    "], "images": [], "type": "contract"},
{"text": "Intermediate Architect", "date": "2019-12-26 09:59", "compensation": "commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/7044509102.html", "address": ["\n        ", "\nWe are currently seeking an Intermediate Project Architect with 5-8 years experience to join our team.", "\n", "\nFor 28 years, Joseph Vance Architects has been designing high end, custom residential projects - brownstone/townhouse gut renovations, ground up townhouses, lofts and rooftop additions. We are a small group of creative problem solvers with a taste for well-crafted design. We value hard work to continuously grow and evolve, pushing boundaries until a project is the best it can be.", "\n", "\nCurrent projects include a ground up new 6 story townhouse in the Upper West Side (with a new basketball court beneath), a gut renovation of a townhouse in Chelsea including a totally new facade, a 6,000sf triplex in a new West Village development, and others.", "\n", "\nAs a member of our team, you will work with directly with the Principal to manage and execute residential projects. You will be responsible for generating designs, presentations and drawings, researching codes, managing schedules, and coordinating with clients, contractors, expeditors, city agencies, vendors, consultants, etc. throughout the entire process of the project from initial client meetings to punch-list closeout. The nature of our business requires immense organization, efficiency, and commitment, but we also maintain a very stable work/life balance.", "\n", "\nIdeally you have experience in residential architecture in NYC, good knowledge of the NYC Building Code and Zoning Resolution, have high skills with 3D modeling and/or BIM software, with 6-8 years of professional experience.", "\n", "\nIf this sounds like you, then please submit a pdf of your cover letter, resume, and work sample. This is a full time salaried position with medical coverage (no part-time or freelance work). We look forward to hearing from you and appreciate your interest in our firm!", "\n", "\nThis is a full time salaried position with benefits (no part-time or freelance positions). Qualified candidates are currently living in the tri-state area and should submit a resume, work samples and salary requirements via .pdf.    "], "images": [], "type": "full-time"},
{"text": "NYC DOB_ Architect _ Architectural Services- filing set_ Freelancer", "date": "2019-12-26 13:41", "compensation": "TBD", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dob-architect/7044670709.html", "address": ["\n        ", "\nArchitectural Services- filing set_ Architect_ Freelancer\\Independent Contractor", "\n", "\nWe are seeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer    "], "images": [], "type": "full-time"},
{"text": "DOB Filing Representative- Freelance", "date": "2019-12-26 13:42", "compensation": "TBD", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-filing-representative/7044671153.html", "address": ["\n        ", "\nJob Description", "\nFiling Representative needed to file DOB Architectural filing set and certificate of correction in Manhattan NY.", "\n", "\nMust have Class 1 or 2 Filing Representative License.", "\n", "\nRESPONSIBILITIES:", "\n", "\nDOB (Department of Buildings)", "\n", "\n1. Pre-filing and E-filing for job filings (ALT 1, 2, 3, Demo, PA)", "\n2. DOB Now Build", "\n3. DOB Now Safety", "\n4. DOB Now Inspections:", "\nSchedule Construction, Plumbing, Electrical inspections", "\nDelegate pertinent parties", "\nDownload Pass - Final Reports and submit for sign-off", "\nUpload corrections for certifiable objections", "\n5. DOB Permits PW 1, PW 2, PW 3, PW4, After hour variances", "\n6. Site Safety Plans", "\n7. Records Room research: microfilm, block and lot, folder", "\n8. Post Approval Amendments", "\n9. Violations (AEU2, AEU20, Dismissals, Waivers)", "\n10. Stop Work Orders, Partial Stop Work Orders", "\n11. Obtain New DOB Tracking Number for Contractors and insurance updates", "\n12. Required Items submission", "\n13. Letter of Completions", "\n14. Temporary and Final Certificates of Occupancy", "\n15. Schedule and attend Plan Examiner appointments to obtain approvals", "\n16. Attend Chief Plan's examiners meetings with Architects, Engineers, Developers, Property Managers", "\n17. Attend meetings with Deputy Borough Commissioners", "\nDOT (Department of Transportation)", "\n", "\n1. DOT Permits: Sidewalk, Fire Hydrant, Curb Cut", "\nECB (Environmental Control Board)", "\n1. Attend ECB hearings", "\n2. Process penalty payments", "\n", "\nTOPO (Topographical Bureau)", "\n", "\n1. Street Address Verification", "\nDOF (Department of Finance)", "\n", "\n1. Tax Maps", "\n", "\nFDNY (Fire Department of the city of New York)", "\n", "\n1. Submit applications", "\n2. Obtain Building Profiles, Notices of Violation and Violation Orders", "\n3. Attend appointments", "\n", "\n", "\n", "\n    "], "images": [], "type": "contract"},
{"text": "Designer/Architect", "date": "2020-01-02 15:00", "compensation": "Competitive Salary - DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-designer-architect/7048525636.html", "address": ["\n        ", "\nSBLM Architects is a nationally recognized firm dedicated to realizing our clients’ goals through results-oriented architecture. The New York City headquarters and branch offices in Long Island, Miami, Dallas, and Dublin, IRL offer a wide range of services through five Design Studios: Mixed-use & Residential, Education, Retail & Commercial, Healthcare & Wellness, and Civic. ", "\n", "\nThe position is for a design role in the New York City headquarters office, located in the Hell’s Kitchen neighborhood of Manhattan. The position will support a wide range of projects primarily from the retail, mixed-use, education, and healthcare sectors. ", "\n", "\nRequirements:", "\n•\tBachelor’s or equivalent professional degree in Architecture", "\n•\t3-10 years of professional experience as a designer in an architectural office", "\n•\tOutstanding conceptual, planning and design skills", "\n•\tAbility to prepare construction documents and develop designs in documents", "\n•\tStrong skillset with Adobe Suite, Autodesk Software and a Modeling/Rendering package", "\n•\tExperience as a designer on built projects", "\n•\tOrganizational skills and ability to work individually and to collaborate in a team", "\n•\tClear and concise communication skills", "\n", "\nDuring the interview candidates will be asked to demonstrate their experience and skillset for creating presentation materials for use in communicating their ideas to clientele, they will be asked to present an examples of their program-layout and planning experience, aesthetic decisions and justifications, and development of design concepts into design documents.   ", "\n", "\nSubmissions:", "\nCandidates should provide a resume and introduction on what they would bring to the position. ", "\nThey must include a portfolio of work via link or attachment. Attachments should not exceed 10MB and be in must be in PDF format.", "\n", "\nCompensation and Benefits:", "\n•\tWe offer an excellent benefit package", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n•\tSalary commensurate with level of experience", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n•\tCreative and innovative work environment", "\n", "\nPlease submit resume and cover letter", "\n    "], "images": [], "type": "full-time"},
{"text": "Construction Estimator", "date": "2019-12-26 17:49", "compensation": "Pay depending on experience.", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-construction-estimator/7044842098.html", "address": ["\n        ", "\nExcavating, Concrete, Masonry and Paving company seeks highly skilled person to perform take offs and prepare estimates. Must have 10 years experience in the Civil field. Knowledge of numbers and prices a must. ", "\n", "\nDuties include making calls for future work, perform takeoffs and estimates, attend job meetings, and assist in managing projects.", "\n", "\nSalary depending on experience. Performance based bonuses and profit sharing available.", "\n", "\nThis is not an entry position. I am looking for a highly qualified estimator to help me grow the company.", "\n", "\nPlease send resume and salary requirements", "\n", "\nWork from home is a possibility", "\n", "\nPart time is also available    "], "images": [], "type": "full-time"},
{"text": "Residential Project Architect | 3 Months-Temporary", "date": "2019-12-27 08:33", "compensation": "$45 per hour", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-residential-project-architect/7045053081.html", "address": ["\n        ", "\nResidential and Mixed Used Architecture Projects.", "\n", "\nBrooklyn office.", "\n", "\nConsult for 3 months in the office collaborating with the team.", "\n", "\nDevelop schematic design, design development and construction document packages.", "\n", "\nRequired skills:", "\n", "\nAutoCAD", "\n", "\nRhino", "\n", "\nSketchUp", "\n", "\nRequired Education:", "\nProfessional Architecture or Design Degree.", "\n", "\n$45 per hour.    "], "images": [], "type": "full-time"},
{"text": "Junior Level Architect | Unique Temporary Opportunity", "date": "2019-12-27 08:40", "compensation": "$35 per hour, or depending upon level of professional experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-level-architect/7045055619.html", "address": ["\n        ", "\nAMAZING TEMPORARY OPPORTUNITY FOR A JUNIOR LEVEL ARCHITECTURAL DESIGNER! 2-3 MONTHS. (Monday-Friday in office, regular business hours)", "\n", "\nTitle:", "\nJunior Architect | Commercial & Retail Architecture Projects", "\n", "\nA successful, well known midtown Manhattan design firm needs additional help in the office for between 2 and 3 months to work as a team member on site surveys and working drawings using AutoCAD for a variety of commercial and retail architecture projects.", "\n", "\nIf you have a professional degree in architecture from an accredited university, work experience and supporting work samples using AutoCAD for design development and construction documents, please submit your detailed resume plus PDF work samples in complete confidence for immediate review.", "\n", "\nWork begins immediately with a competitive hourly rate.", "\n", "\nPlease submit PDF attachments only. Thank you!    "], "images": [], "type": "contract"},
{"text": "Field Personnel (Entry Level)", "date": "2019-12-27 14:41", "compensation": "$15/hr min....varies on experience and position", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-field-personnel-entry/7045312754.html", "address": ["\n        ", "\nCivil Engineering Land Surveying Firm", "\nFull time ENTRY level position in field with Staten Island Firm. Great for interns.", "\nExcellent career opportunity for individuals with 2-4 degrees in Civil Engineering or Land Surveying.", "\nState Salary requirements    "], "images": [], "type": "full-time"},
{"text": "PT FT Architects Intern Drafter experienced or student", "date": "2019-12-27 15:44", "compensation": "by experience and base on 1st week of performance", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-pt-ft-architects-intern/7045359808.html", "address": ["\n        ", "\nOffice looking for Architects, Intern, Drafter, multiple positions, experienced full time, student part time. Must be good with AutoCAD. Please email with resume and portfolio if available. Able to speak mandarin a plus.    "], "images": [], "type": "employee's choice"},
{"text": "LAND SURVEY TECHNICIAN/PARTY CHIEF", "date": "2019-12-29 19:26", "compensation": "negotiable", "link": "https://newyork.craigslist.org/que/egr/d/jamaica-land-survey-technician-party/7046542982.html", "address": ["\n        ", "\nSeeking experienced individuals to work  as a Survey Technician/ Party Chief. Experience required is", "\nAble to sketch detailed and accurate field notes.", "\nWork independently with a robotic total station and GPS", "\nDraft with AUTOCAD    "], "images": [], "type": "full-time"},
{"text": "Plumbing / Fire Protection Engineer", "date": "2019-12-30 09:30", "compensation": "70k-105k", "link": "https://newyork.craigslist.org/mnh/egr/d/long-island-city-plumbing-fire/7046730306.html", "address": ["\n        ", "\nSenior Plumbing / Fire Protection  Designer -- NYC  / Queens area ", "\n", "\nIdeal candidate will have 2-10 years experience designing plumbing systems in facilities including multi-family, hi-rise, healthcare, institutional and high tech industrial.  ", "\n", "\nPrefer candidates with hi-rise / multi-family project experience.", "\n", "\nMust be proficient with AutoCAD ", "\n", "\nRevit experience is a plus. ", "\n", "\nSalary and benefits are commensurate with experience ", "\n", "\nEmployee Medical fully covered by employer", "\nPTO", "\nPaid Holidays and more... ", "\n", "\nNo 3rd party agencies please.", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Manager", "date": "2019-12-30 12:44", "compensation": "Based on experience", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/7046867741.html", "address": ["\n        ", "\nProject manager needed for drywall company based in queens.", "\nMust have experience as a project manager on drywall jobs", "\nMust be reliable, motivated and excellent organizational skills.", "\nProficient in  take off, reading plans, prepare proposals, quick books, Microsoft word and excel.", "\nMust have the ability to manage new and existing drywall construction.", "\nPlease send salary requirements with resume.", "\nThe ideal candidate must be well versed in the drywall industry", "\n    "], "images": [], "type": "full-time"},
{"text": "Senior Architect", "date": "2019-12-30 15:44", "compensation": "Please forward your salary requirements", "link": "https://newyork.craigslist.org/mnh/egr/d/senior-architect/7047008321.html", "address": ["\n        ", "\nSenior Architect", "\nNelligan White Architects is a 25‐person firm located in New York’s Flatiron district. The majority of our design work is focused on municipal, cultural, education and multi‐residential housing projects, and we have been recognized for our expertise in resilience master planning and sustainability.", "\n", "\nIdeal applicants will demonstrate the following attributes:", "\n", "\n•\tHighly motivated", "\n•\tThe ability to work independently and leading a team", "\n•\tExemplary verbal and written communication", "\n•\tSenior level work experience with all phases of design and construction administration", "\n•\tBe a conceptual thinker with strong technical skills (design and drawing)", "\n•\tExperience providing detailed construction documents ", "\n•\tExperience writing specifications", "\n•\tThe ability to work efficiently in a fast-paced environment", "\n", "\nResponsibilities & Duties", "\n•\tPrepare original architectural plans, diagrams and data visualization.", "\n•\tLead design assignments and supervise team progress.", "\n•\tIndependently evaluate, select and apply standard planning techniques, procedures, and criteria", "\n•\tUsing judgment for minor adaptations and modifications.", "\n•\tRecommend procedures in planning matters.", "\n•\tWork from plans/designs of others to compile data and perform design computations.", "\n•\tAssist in writing specifications.", "\n•\tVisits construction sites to gather information.", "\n•\tReceives instruction on specific assignment objectives and independently provides solutions for these objectives.", "\n•\tSupport Principal/Partners on large projects.", "\n•\tManage a team of intermediate to junior designers", "\n", "\nQualifications", "\n•\t10 years’ experience with a professional degree in Architecture and license preferred", "\n•\tHigh proficiency with AutoCAD. Adobe Suite and Revit knowledge is a plus.", "\n•\tStrong analytical and conceptual skills and ability to grasp complex functional program requirements.", "\n•\tEffective verbal and written communication skills.", "\n•\tThe ability to work well leading a team environment with a collaborative and professional work ethic.", "\n•\tExperience working with large public agencies is a plus", "\n", "\nApply with the following items attached as one PDF in a zip file, Please enter “Intermediate Architect” in the subject line.", "\n•\tCover letter", "\n•\tResume in PDF format", "\n•\tPortfolio and work samples include renderings and construction document samples", "\n•\tSalary requirements", "\n•\tTwo references that you have worked directly with in the last five years", "\n", "\nNelligan White Architects offers a competitive salary and benefits package, which includes: medical, dental and vision insurance, flexible spending account, disability insurance, paid time off, holiday pay and 401(k) participation. This is a full‐time, exempt position.", "\n", "\nNelligan White Architects, PLLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. Nelligan White Architects expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability or veteran status.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Architect/Designer", "date": "2019-12-30 14:59", "compensation": "Compensation commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/7046974455.html", "address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "], "images": ["https://images.craigslist.org/01111_gaz8wvs7ByI_600x450.jpg", "https://images.craigslist.org/00g0g_jDYofhdlyZr_600x450.jpg", "https://images.craigslist.org/00x0x_b0YNtzeGhjW_600x450.jpg", "https://images.craigslist.org/00l0l_ba9tKkfF3fQ_600x450.jpg", "https://images.craigslist.org/01010_9yRW0bTI4Ba_600x450.jpg", "https://images.craigslist.org/01111_3rdGpKVfJwx_600x450.jpg", "https://images.craigslist.org/00M0M_bg31Pw2wAox_600x450.jpg", "https://images.craigslist.org/00l0l_jiZu8SEJy6A_600x450.jpg", "https://images.craigslist.org/00t0t_dD1efPwvANu_600x450.jpg"], "type": "full-time"},
{"text": "Electrical Engineer", "date": "2019-12-30 09:32", "compensation": "75k-105k", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-electrical-engineer/7046731028.html", "address": ["\n        ", "\nTitle: Electrical Engineer", "\n", "\nDuties & Responsibilities:", "\n", "\n-Design Electrical Systems  From Inception to Complete Construction Documents ", "\n-Prepare Specifications ", "\n-Survey of Existing Building Conditions ", "\n-Assist in the Preparation of Reports ", "\n-Complete all Phases of Design from Schematic through Construction Administration", "\n-Preparation of Drawing and Specifications ", "\n-Knowledge of NYC Filing Requirements and Procedures ", "\n-Knowledge of Utility Companies Filing Requirements and Procedures ", "\n-Coordination Between Architectural and Engineering Disciplines ", "\n-Must have a working knowledge of AutoCAD with prior experience designing in an MEP Environment. ", "\n-Strong Computer Skills and knowledge of REVIT Models a Plus", "\n", "\n", "\nDesired Skills & Experience:", "\n3+ Years experience", "\n", "\nAdditional Information:", "\n", "\nType: Full-timeFunctions: EngineeringExperience: Junior LevelIndustries: Architecture & Planning, Construction, Design", "\n", "\nSalary Commensurate with experience", "\nFull benefits ", "\nPTO", "\nPaid Holidays ", "\n401k and more.    "], "images": [], "type": "full-time"},
{"text": "ARCHITECT", "date": "2019-12-30 16:06", "compensation": "fee per job", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect/7047024319.html", "address": ["\n        ", "\nlooking for a architect with NYS licence and registered in NYC to review and consult construction drawings for  legality and work together on the job.", "\nPlease send you resume along with your licence #    "], "images": [], "type": "contract"},
{"text": "CIVIL ENGINEERS & Surveyors - All Levels", "date": "2019-12-29 23:31", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-civil-engineers-surveyors/7046626141.html", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Structural Engineer and Land Surveyor  ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Transportation Engineering, Water Resources, Structural Engineering and Land Surveying  ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "\n\n", "\n\n KEYWORDS: civil engineering, site development, land development, grading, drainage, storwmwater, SWPPP, paving, striping, traffic control, transportation, signal, signage, railway, highway design, roadway, water, wastewater, hydrology, hydraulics, earthwork, utility design, water resources, wastewater, Autocad, Civil 3D,  REVIT, StaadPro, Microstation, inroads, ArcGIS, surveying, topos, geotechnical, geotech, GIS, structural, ASCE, EIT, PE, TE, survey, surveying, topos, boundaries, ALTA maps, legal description and plats, Appraisal Maps, Records of Survey, topography, photogrammetry, boundary surveys, construction staking, topcon, leica, carlson subdivision mapping, total station, PLS, RPLS, LSIT, SIT\n    "], "images": ["https://images.craigslist.org/00V0V_1XwzjcyU0FQ_600x450.jpg", "https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00s0s_4QP14z6XpvA_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00a0a_drf409kow45_600x450.jpg", "https://images.craigslist.org/00K0K_2pN2wVLEmq0_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00G0G_jdOW9YQ43na_600x450.jpg", "https://images.craigslist.org/00t0t_51D2oDR2mzC_600x450.jpg", "https://images.craigslist.org/00A0A_k6oLYjPcwd5_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00d0d_WSUtQ2ZUsO_600x450.jpg", "https://images.craigslist.org/00u0u_eWrZMPd73KC_600x450.jpg", "https://images.craigslist.org/00Q0Q_kWW1LPZt9Rt_600x450.jpg"], "type": "full-time"},
{"text": "Auto Cad Draftsperson/Landscape Designer", "date": "2019-12-31 13:47", "compensation": "tbd", "link": "https://newyork.craigslist.org/lgi/egr/d/sound-beach-auto-cad-draftsperson/7047490991.html", "address": ["\n        ", "\nLandscape Designer/ Assistant to Principal /Drafts Person (Miller Place).  Landscape Design/Build/Furnish Firm currently seeking a qualified individual with experience in Auto Cad, SketchUp or other rendering software, Microsoft Office and Photoshop. Position available for a mature, disciplined, self motivated, honest, hard working, and committed individual.", "\nPart time independent contracting position. Flexible hours, office and field work. Competitive pay. Comfortable office setting with ability to work from home, working on exciting high-end residential landscape design / build projects. ", "\nCandidate must own their own Auto-Cad program, Lap-top and transportation. Candidate will be involved in design, construction details, estimating, field supervision and drafting. ", "\nPlease send resume and cover letter. No resumes with residency outside of Suffolk County, NY will be considered. Please have the experience and examples of design work before applying.", "\n    "], "images": [], "type": "part-time"},
{"text": "CAD/ESTIMATING/TAKE OFF SPECIALIST", "date": "2019-12-31 11:55", "compensation": "salary plus commission", "link": "https://newyork.craigslist.org/que/egr/d/college-point-cad-estimating-take-off/7047414021.html", "address": ["\n        ", "\nBusy iron work shop/overhead door company looking for experienced individuals.", "\n", "\nMust have;", "\n5 years experience with CAD", "\n5 years experience with iron works and or overhead doors", "\n2 years of prior internet/ebay/sales experience", "\n", "\n", "\nDuties include but not limited to;", "\nviewing drawings and specifications", "\npreparing pricing sheet for each project", "\ncontacting outside vendors/contractors for pricing", "\npreparing shop drawings and submittal packages", "\nAIA invoicing ", "\nkeeping track of bid due dates    "], "images": ["https://images.craigslist.org/00c0c_3vkLsXuFlS2_600x450.jpg", "https://images.craigslist.org/00e0e_kH6MpgG4zfL_600x450.jpg", "https://images.craigslist.org/00d0d_bPiAFkUAYDo_600x450.jpg"], "type": "full-time"},
{"text": "Project Architect/ Project Manager", "date": "2019-12-31 18:00", "compensation": "Competitive salary and benefits package based on skills and experience", "link": "https://newyork.craigslist.org/mnh/egr/d/brooklyn-project-architect-project/7047630539.html", "address": ["\n        ", "\nArchitectural firm seeking a candidate with 7-10 years’ experience in architectural and interior design to provide quality control and construction administration focusing on interior finishes and detailing for a large public project in midtown Manhattan.", "\n", "\nResponsibilities:", "\n- Full time position at Manhattan midtown Field Office to oversee and manage schedule of mock-ups and samples of interior finishes", "\n- Coordination of Architectural and Interior details with contractor during the construction phase.", "\n- Coordination with design drawings during the construction process ", "\n- Quality control of construction and mock-ups. Coordination and verification of materials, finishes and details.", "\n- Communication with design team to resolve design/ technical related items prior to fabrication/ installation.  ", "\n- Review of contractor's shop drawings in Construction Administration phase to guarantee compliance of  with architectural design intent.", "\n", "\nRequirements:", "\n- Willing to work full time for +/- 1 year at the site office.", "\n- B Arch degree is a minimum requirement.", "\n- 7 - 10 years of experience in all phases of architectural and interior design, construction documents and construction administration. ", "\n- Experience in construction administration of large scale projects desirable.", "\n- Proficiency in AutoCAD and Revit, with experience in construction documents/ interior detailing.", "\n- Good written and verbal communication skills.", "\n- Familiarity with NYC and NYS codes.", "\n- Must be a team player with a good attitude and the ability to work under pressure to meet deadlines when necessary.", "\n- Must be legally authorized to work in the US", "\n- Send a cover letter, resume, portfolio and references (No phone calls or faxes please)    "], "images": [], "type": "full-time"},
{"text": "Project Manager / Asst Project Manager", "date": "2020-01-01 11:48", "compensation": "55-100k dependant on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager-asst-project/7047834657.html", "address": ["\n        ", "\nWe are the top residential design/build firm in the city and we are seeking to fill two positions:  Lead Project Manager and Asst Project Manager.  The positions are available at this time and are centric to Hi -End Residential work", "\n", "\nResponsibilities:", "\n•\tMonitor all phases of construction", "\n•\tAssist with monitoring construction schedules and budgets", "\n•\tCoordinate with Clients, Subcontractors and Suppliers", "\n•\tCompose Submittals", "\n•\tProcess Change Orders", "\n•\tPost Daily Reports", "\n•\tPrepare Meeting Minutes", "\n•\tSupervise trades", "\n", "\nRequirements", "\n•\tFull Knowledge of AutoCad", "\n•\tMUST HAVE - Field Project Experience", "\n•\tMS Office proficiency", "\n•.      Workplace by Facebook proficiency", "\n•\tAbility to read drawings and spec/source materials.", "\n", "\nExperience:", "\n•\tMinimum 2-year experience as an Assistant Project Manager or equivalent role, preferably in NYC", "\n•\tResidential Design / Interiors construction project management experience preferred", "\n•\tExperience with all the Microsoft Suite software especially excel.", "\n", "\nCompensation:", "\n•\tHealth benefits", "\n•\tAnnual performance reviews", "\n•\tSalary commensurate with experience", "\n•\tEnd of year holiday bonus", "\n•\tOpportunity for financial, professional and personal growth    "], "images": [], "type": "full-time"},
{"text": "JUNIOR AUTOCAD / PROJECT DESIGNER- RESIDENTIAL RENOVATION: TRHNYC", "date": "2020-01-01 11:55", "compensation": "55-69k Annual DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-autocad-project/7047837848.html", "address": ["\n        ", "\nWe are The Renovated Home, New York City's premier Design/Build firm at the high end and we are seeking to hire a full-time Project Designer to work on a 1-3 high-end residential projects.", "\n", "\nFor the Project Designer position in New York City, the applicant must have extensive professional experience and knowledge of residential detailing, shop drawings and superior AutoCAD skills. The qualified candidates will need to be enthusiastic, hard working, well-organized and highly motivated w/excellent verbal and written communications skills. We call our approach from Cradle to College so the project designer is involved in every facet of the project - right through the move in.", "\n", "\nCandidates will work directly with the firm's principal and project team to produce highly detailed designs, construction documents and manage all aspects of the projects during construction. Supervision available to assist w/completion of NCARB Intern Development Program.", "\n", "\nQUALIFICATIONS", "\n", "\n- Minimum (3) Years of Experience in High-end Residential Construction & Detailing", "\n- Technical Expertise in AutoCAD, Expansive Construction Documents Experience", "\n- Proficiency in Adobe Photoshop, 3D Modeling advantageous", "\n- A minimum of (2) professional references.", "\n-Candidates must confirm eligibility/qualifications to work in United States", "\n", "\nJob Type: Full-time", "\n", "\nSalary: $50,000.00 to $67,000.00 /year    "], "images": [], "type": "full-time"},
{"text": "Architectural Consultant/Expediter", "date": "2020-01-02 12:04", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/architectural-consultant-expediter/7048375317.html", "address": ["\n        ", "\nBuilding and Zoning Law Consultant is seeking college graduates with Bachelors and/or Masters in Architecture or Engineering and an interest in the Department of Buildings Code Consultation/Expediting for a full time position.  Filing representatives with Class 1 or 2 DOB IDs will also be considered.  ", "\n", "\nApplicants must have the ability to communicate the items required for approval with colleagues and clients. Must be able to multi-task in order to expedite a large number of projects. Applicants must have strong communication, organizational and computer skills. Microsoft Word, Outlook and Excel experience required. ", "\n", "\nPlease send resume detailing past experience and include salary requirements.  Experience with NYC Building Code and Zoning Law is preferred but not required.  Please indicate your level of experience in your reply.", "\n", "\nWe offer a competitive salary based on level of experience along with an extensive benefits package including Metrocards, paid vacation, 401k with Employer match and medical, dental, vision and life insurance.", "\n", "\nIf this ad is up, the job is available, no matter the posted date. ", "\n", "\nWe are an Equal Opportunity Employer.", "\n    "], "images": [], "type": "full-time"},
{"text": "Assistant Construction Project Manager", "date": "2020-01-02 08:37", "compensation": "Competitive", "link": "https://newyork.craigslist.org/brk/egr/d/new-york-assistant-construction-project/7048240104.html", "address": ["\n        ", "\nAssist PM directly onsite - at least 1 year of construction experience is needed.", "\n", "\nWe are looking for an individual who is eager to learn, motivated and a go-getter. Please reply with your resume.", "\n", "\nResponsibilities and Duties:", "\n", "\nTrack and document and alert the PM to changes to project scope", "\nGenerate and track RFI's, submittals, updated drawings, sketches etc.", "\nUpdate PM and Site Super on scheduling, deliveries, lead times, dependencies and all specification and plan changes as they occur", "\nSchedule deliveries with suppliers via company office", "\nWeekly Timeline update for PM", "\nImplement site safety program along with PM", "\nKeep detailed daily logs of work performed along with delivery log", "\nLabor management and time tracking of crews, daily sign in for crew", "\nCreate, coordinate and manage photo log of projects week to week", "\n", "\nQualifications and Skills:", "\n", "\nClear communication", "\nConcrete and masonry experience desired", "\nHighly organized", "\nProblem-solving", "\nOn-time", "\nExcellent Microsoft Excel, Word, Adobe Acrobat and Outlook", "\nExcels in team environment", "\nAble to understand construction drawings", "\nOsha 30 required", "\n62hr SST is a plus", "\n", "\nJob Type: Full-time    "], "images": [], "type": "full-time"},
{"text": "Architectural drafter", "date": "2020-01-01 16:16", "compensation": "competitive rate", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-drafter/7047982499.html", "address": ["\n        ", "\nQualifications:", "\nMinimum experience: 3 years in architectural drafting", "\nStrong knowledge of AutoCAD.", "\nConstruction Documents Experience", "\nDegree in architecture preferred.", "\n3D modeling / rendering skills ", "\nBasic knowledge of NYC Zoning Regulations and NYC Building Code", "\nRequired professional references: 2 min    "], "images": [], "type": "full-time"},
{"text": "Office Administrator Wanted @ Architectural Firm", "date": "2020-01-02 13:45", "compensation": "$35K-$40K Annually", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-office-administrator-wanted/7048462384.html", "address": ["\n        ", "\nWe are a small residential architectural firm seeking an Office Administrator candidate with prior experience in the design industry and with working knowledge of Excel and MS Word (AutoCad, Sketch-Up and Adobe Suite are a plus). The position is full-time with immediate availability. ", "\n", "\nDuties Include:", "\nAnswering Calls", "\nPreparing and issuing invoices via Excel", "\nPreparing and issuing proposals via MS Word", "\nMaintain Sample Department / Library ", "\nFiling", "\nAssist Staff as Needed", "\n", "\nRequired Skills:", "\nProfessionalism", "\nAbility to Multi-Task ", "\nGreat Organizational Skills ", "\nPortfolios Welcomed", "\n", "\nEmail cover letter, resume, and portfolio (if available). ", "\nNo phone calls, please.    "], "images": [], "type": "full-time"},
{"text": "Architectural Senior Drafter/Job Captain", "date": "2020-01-02 13:46", "compensation": "Competitive Salary - DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-senior-drafter/7048463475.html", "address": ["\n        ", "\nSBLM New York is looking for a highly motivated Senior Drafter/Job Captain who has a passion for understanding weather related problems that occur on existing older buildings.", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters as required", "\nProduce deliverables without requiring constant supervision", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3 or more years’ experience in an Architect’s office", "\nMust be proficient in AutoCAD, Revit and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction administration ", "\nExperience working with exterior envelope", "\nPositive attitude and driven to succeed", "\n", "\n. Compensation and Benefits:", "\n•\tWe offer an excellent benefit package", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n•\tSalary commensurate with level of experience", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n•\tCreative and innovative work environment", "\n.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Senior Drafter/Job Captain in the subject. No phone calls, please.", "\n    "], "images": [], "type": "full-time"},
{"text": "Electronic technician", "date": "2020-01-02 15:51", "compensation": "to be discussed at interview", "link": "https://newyork.craigslist.org/wch/egr/d/port-chester-electronic-technician/7048566280.html", "address": ["\n        ", "\nWe're looking for a technician for a phone repair store. He/she has to be able to repair most electronics from phones to computers. Please send your resume to the posted email. Thank you.    "], "images": [], "type": "full-time"},
{"text": "Sales & Design Coordinator", "date": "2020-01-02 16:42", "compensation": "This role offers a competitive salary in addition to inclusion in the company’s profit sharing, 401K, medical, and dental programs.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-sales-design-coordinator/7048605165.html", "address": ["\n        ", "\nAmuneal Manufacturing Corp. has an immediate opening in our New York Showroom for a Sales & Design Coordinator.  This role will focus on our luxury furniture and architectural product offerings. This role is primarily responsible for customer support and collaboration with our Sales + Design team. ", " \n", "\nConfidence, a clean design aesthetic, the ability to spark interest in others, direct customer interaction and experience in the selling of high-end designed products are a must. Candidates must have the ability to organize their own time, multitask in a dynamic environment, be proactive, and above all else…problem solve. We are looking for someone who is eager to connect with people and translate their needs into timeless experiences and products. To be successful, candidates must have a strong interest in the creation of high-end products. Candidates must be looking for a role where they are part of a collaborative environment and able to make an impact on the organization each day.", "\n", "\n", "\n", "\n\n", "\n", "\n", "\n", "\nPlease submit both resume and cover letter for consideration.", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Manager/Site Superintendent", "date": "2020-01-02 17:41", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-project-manager-site/7048647059.html", "address": ["\n        ", "\nTo provide Management, Supervision and coordination for all phases of NYC School Construction Authority projects, including coordinating subcontractors, material and equipment, ensuring that specifications are being strictly followed, and work is proceeding on schedule and within budget. PM/Superintendent shall be responsible for scheduling, inspections, quality control, and job site safety. ", "\n", "\nEssential Functions / Major Responsibilities of PM/Superintendent: ", "\n ", "\nSchedule subcontractors, consultants, and vendors in critical path to ensure timely completion.  ", "\nPerform quality control duties and responsibilities regarding the work being performed.  ", "\nCommunicate with project team regarding Change Orders, RFI’s, and Material Submittals. ", "\nEnsure that subcontractors are fully executing and complying with his contracted scope of work.  ", "\nCoordinate required inspections with local owner QA-QC and Controlled lab.  ", "\nIdentify subcontractor non-compliance with safety, health, and environmental quality standards.  ", "\nIdentify conflicts in construction progress and communicate them to project team for resolution.  ", "\nMaintain daily log (written) of activities on the jobsite.  ", "\n Ensure subcontractor has corrected all deficiencies identified by project team.  ", "\nPreside over weekly subcontractor meetings designed to coordinate the work.  ", "\nIssue notices of non-compliance to subcontractors in regards to quality of work or scheduling or safety.  ", "\nEnsure that the job site is always kept in a clean and organized manner.  ", "\nPerform job progress and completion punch list identification and completion. ", "\n ", "\nSecondary Functions:  ", "\n ", "\nAssist in budgeting, bidding, and award of subcontracts.  ", "\nAssist in obtaining permits or approval of revisions.  ", "\nGather project material submittals and maintain records of approvals at the job-site.  ", "\nPreside at pre-construction meeting with each subcontractor.  ", "\nAssist in hiring sub-tier employees. ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Class 2 Senior Project Manager / Code Consultant", "date": "2020-01-03 11:09", "compensation": "Competitive Compensation- commensurate with experience and includes health, dental and vision options available. Paid vacation, personal, and sick days as well.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-class-2-senior-project-manager/7048988980.html", "address": ["\n        ", "\nA Manhattan based full-service expediting, building compliance and consulting firm, is seeking a full-time, experienced Senior Project Manager / Code Consultant who possesses a Class 2 DOB License.", "\n", "\nRequired Credentials for Position:", "\n•\tActive NYC DOB Code and Zoning Representative Class 2 License & FDNY File Rep ID", "\n•\tMinimum five to ten (5-10) years of relevant experience and working with agencies such as DOB, FDNY, ", "\n        ECB, DEP...etc.", "\n•\tAbility to attend appointments with Department of Buildings Plan Examiners to review and answer ", "\n        objections and report back to the superiors", "\n•\tAbility to attend Environmental Control Board Hearings and aid in dismissing open violations (A PLUS)", "\n•\tResponsible for following up on all submissions and report Department of Buildings findings to the office", "\n•\tReview architectural and engineering plans for compliance to applicable building codes and zoning ", "\n        regulations.", "\n•\tDistribute the forms to the architect, engineer, building owner, contractor, etc., in order to obtain the ", "\n        required signatures and seals.", "\n•\tCoordinate the submission of the architectural and or engineering plans to DOB.", "\n•\tCorrespondence and communication with the architect, engineer, building owner, contractor, etc. to resolve ", "\n        DOB objections and obtain approval and work permits.", "\n•\tServe as a liaison between the field personnel and the architect, engineer, building owner, contractor, etc. to ", "\n        resolve DOB objections and obtain approval and work permits and sign-offs.", "\n•\tExperience with the preparation of DOB forms, permits and violation documentation", "\n•\tExperience with Development Hub", "\n•\tExperience with DOB NOW", "\n•\tAble to use Microsoft Office Suite (OUTLOOK, WORD, EXCEL)", "\n•\tResponsible for following up on all projects", "\n•\tProfessional attitude with great communication (written and verbal) and organizational skills a must", "\n•\tAbility to the follow office protocols and procedures a must", "\n•\tTeam Player with strong Project Management skills", "\n", "\nEducation Requirements:", "\n•\tCollege Degree in Related Field (preferred)", "\n", "\nCompensation: Competitive Compensation- commensurate with experience and includes health, dental and vision options available. Paid vacation, personal, and sick days as well.", "\n", "\nJob Type: Full-time", "\n    "], "images": [], "type": "full-time"},
{"text": "Structural Engineer", "date": "2020-01-03 11:04", "compensation": "medical coverage", "link": "https://newyork.craigslist.org/que/egr/d/structural-engineer/7048984818.html", "address": ["\n        ", "\nR & O Engineering, PC one of the leading Structural Engineering Company in Queens, NY is seeking a full time Structural Engineer. Responsibilities for this job includes planing, reviewing, and finalizing projects according to deadlines.", "\n", "\nREQUIREMENTS AND RESPONSIBILITIES", "\n", "\n· BS or MS degree in Structural or Civil Engineering.", "\n. Structural analysis and design- more than three years.", "\n· Excellent communication skills (internal and external).", "\n· Experience in NYC projects, working knowledge of New York City codes.", "\n· Manage multiple projects.", "\n· Ability to effectively manage multiple tasks and projects in the same time.", "\n· Proven ability to successfully deliver projects on time.", "\n. Engineering of steel, light gauge design, masonry design and Concrete superstructures.", "\n. Design of structural  systems for small complex buildings.", "\n· Visual acuity adequate to perform job duties, including reading information from printed sources and computer screen.", "\n. Be informed and communicative about new and old projects.", "\n. Coordinate and respond to client requests for changes in project scope, address revisions.", "\n. Knowledge of structural software skills including AutoCAD, Etabs, RAM, Safe, and PCA, ", "\n", "\nR & O Engineering is proud to be an equal opportunity employer. We offer a competitive salary and good benefits package, including healthcare benefits. Interested candidates, please forward resume and salary requirements.", "\n", "\nJob Type: Full-time", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Manager (DOB Class 1 or 2 ID)", "date": "2020-01-03 11:19", "compensation": "Competitive Compensation- commensurate with experience and includes health, dental and vision options available. Paid vacation, personal, and sick days as well.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager-dob-class-1-or/7048996998.html", "address": ["\n        ", "\nA Manhattan based full-service expediting and consulting firm, is seeking a full-time, experienced Project Manager with a Class 1 or 2 DOB File Rep ID", "\n", "\nRequired Credentials for Position:", "\n• Active NYC DOB Code and Zoning Representative Class 1 or 2 License", "\n• Minimum five (5) years of relevant experience with filing procedures at DOB, FDNY, LPC, DEP, DOT, MTA,", "\n  ECB...etc.", "\n• Ability to attend appointments with Department of Buildings Plan Examiners to review and answer", "\n  objections and report back to the superiors", "\n• Responsible for following up on all submissions", "\n• Report Department of Buildings findings to the office", "\n• Professional attitude with great communication (written and verbal) and organizational skills a must", "\n• Able to use Microsoft Office Suite (outlook, word, excel)", "\n• Ability to the follow office protocols and procedures a must", "\n• Experience with the preparation of DOB application forms and permits a plus", "\n• Experience with Development Hub ", "\n• Experience with DOB NOW", "\n• Active FDNY ID a plus", "\n• Knowledge and understanding of construction plans and documents a plus", "\n• Punctual", "\n", "\nEducation Requirements:", "\n• College Degree in Related Field (preferred)", "\n", "\nCompensation: Competitive Compensation- commensurate with experience and includes health, dental and vision options available. Paid vacation, personal, and sick days as well.", "\n", "\nNote: Principals only. Recruiters, please don't contact this job poster. DO NOT contact us with unsolicited services or offers", "\n", "\nJob Type: Full-time", "\n    "], "images": [], "type": "full-time"},
{"text": "engineer- structural", "date": "2020-01-03 12:22", "compensation": "good compensation and advancement opportunities", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-engineer-structural/7049049876.html", "address": ["\n        ", "\nProject structural engineer for design of building projects. ", "\nGood communication skills required.", "\n    "], "images": [], "type": "full-time"},
{"text": "Drafting / Structural / Site Safety Plans", "date": "2020-01-02 09:31", "compensation": "Will be discussed", "link": "https://newyork.craigslist.org/que/egr/d/new-york-drafting-structural-site/7048264676.html", "address": ["\n        ", "\nLooking for CAD drafters, Architectural, Structural, MEP, Safety Plans and Site Safety Plans. ", "\n", "\nPlease send resume and sample work. Also a sample of any site safety plans you did in NY.    "], "images": [], "type": "employee's choice"},
{"text": "Project Architect(s)", "date": "2020-01-03 14:00", "compensation": "Commensurate with Experience", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/7049134553.html", "address": ["\n        ", "\nMssa, a Small Successful 8-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "], "images": ["https://images.craigslist.org/00q0q_j3yUmHZgn3i_600x450.jpg", "https://images.craigslist.org/00Q0Q_lOrCMRAjq24_600x450.jpg", "https://images.craigslist.org/00u0u_4FxJckhY6el_600x450.jpg", "https://images.craigslist.org/00c0c_bJswHq7lLgP_600x450.jpg"], "type": "full-time"},
{"text": "Facade / Building Envelope Project Manager", "date": "2020-01-03 18:10", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project-manager/7049329298.html", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer or architect with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us as a Project Manager  in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "], "images": [], "type": "full-time"},
{"text": "Structural Engineer", "date": "2020-01-08 13:33", "compensation": "The salary is based on level of experience.", "link": "https://newyork.craigslist.org/que/egr/d/flushing-structural-engineer/7052249864.html", "address": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking structural engineers at multiple levels to join our team. As a structural engineer, you will work with other team members in our highly collaborative environment to assure that designs are developed in accordance with appropriate codes and standards, quality control objectives are achieved, and project goals are met within the schedule and budget. This is an outstanding opportunity for a structural engineer to work on a variety of high-profile projects throughout the region. ", "\n", "\nDuties and Responsibilities:", "\n", "\n- Coordinate with architects, contractors, owners, and other engineers from the initial planning stages through final construction.", "\n- Determine design criteria using relevant codes and standards.", "\n- Analyze and/or prepare models and calculations for various structural elements and systems by using various software and/or hand calculations.", "\n- Develop contract documents, including construction drawings and technical specifications", "\n- Produce schematic and detailed designs and evaluation of planning and concept alternatives", "\n- Review shop drawings, RFI's.", "\n- Perform field inspections and write inspection reports.", "\n", "\nSkills and Qualifications:", "\n", "\n- Familiar with latest version of AutoCAD, Revit, ETABS, SAP2000, SAFE, RAM, Excel.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n", "\nEntry Level Candidates:", "\n- Bachelor’s degree in Civil or Structural Engineering.", "\n", "\nIntermediate Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 3+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n", "\nAdvance Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 8+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n- NYS PE License", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Job- Casting: Are you in love with an international student", "date": "2020-01-03 18:20", "compensation": "Will be paid if chosen for the series", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-job-casting-are-you-in-love/7049335229.html", "address": ["\n        ", "\nAre you in a relationship with an international student? Are you in a serious relationship with an international student attending a school in the United States? Glass Entertainment Group is teaming up with a major cable network to follow couples where one person in the relationship is a U.S. citizen and the other is in the country on a student visa that is expiring in Spring/Summer 2020. ", "\n", "\nIf you think you and your partner are a good fit, please reply with a small description of your relationship as well as your contact info and photo.", "\n", "\nWe look forward to hearing from you.    "], "images": [], "type": "contract"},
{"text": "Project Architect -Revit | Multi Family Residential", "date": "2020-01-08 13:54", "compensation": "80-90K", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect-revit-multi/7052267808.html", "address": ["\n        ", "\nSalary up to 100K  ", "\nIntermediate/Senior Level Architect | Project Architect  ", "\nImmediate Opportunity with true professional development. Full time position with salary + benefits package. Work on high profile condo conversions with a focus upon design. ", "\nInvolvement includes Design through Construction including Construction Documents.  ", "\nTo be considered for this unique position all candidates must have the following: ", "\nBachelor of Architecture or Masters of Architecture from an accredited university. ", "\n3-10 years of current New York City residential architecture project experience. ", "\n2+ years of experience with a minimum of 2 completed projects using Revit in a professional office setting. Experience with and strong knowledge of New York building code and zoning requirements. ", "\n", "\nCandidates must also be authorized and eligible to work in the U.S. for any employer.", "\n", "\nFirm Description:", "\nMulti-disciplinary design focused architecture and design firm with a focus upon New York City multi-family residential projects.    "], "images": [], "type": "full-time"},
{"text": "Drafter/Estimator Experienced in steel fabrication", "date": "2020-01-04 06:35", "compensation": "25", "link": "https://newyork.craigslist.org/que/egr/d/flushing-drafter-estimator-experienced/7049531546.html", "address": ["\n        ", "\nWe are seeking an in house person experienced in steel fabrication to detail our incoming jobs and do takeoffs for bidding on projects as well.Must be somewhat experienced. Please reply in detail for interview,thanks.    "], "images": [], "type": "full-time"},
{"text": "Facade / Building Envelope Architect", "date": "2020-01-03 18:13", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/7049330903.html", "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2-5 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "], "images": [], "type": "full-time"},
{"text": "PART TIME / FREELANCE / INT ARCHITECTURAL DESIGNER - ENTRY LEVEL", "date": "2020-01-09 06:52", "compensation": "Hourly pay commensurate with experience.", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-part-time-freelance-int/7052653705.html", "address": ["\n        ", "\nKDA is looking to hire a part-time /freelance designers/ and interns to join our firm.  We are a boutique design outfit specializing in bespoke high-end residential design. We are looking to find a talented and motivated entry-level designer to contribute to all phases of design.  Responsibilities would include design, drafting, detailing, site visits, and construction administration.  Ideal candidates would also be interested in helping the firm in its rebranding project and be excited to work on graphics, social media, standardization, renderings, competitions, and another firm critical clerical work.", "\n", "\nWe offer great flexibility and work/life harmony balance.  This is opportunity is best suited for somebody looking to gain a significant amount of experience and responsibility quickly.  Possibility for this position to transition to full time if desired. ", "\n", "\nVectorworks experience preferred.  ", "\n", "\nPlease send resumes, cover letters, and portfolios (NTE 10MB) along with availability and compensation expectations. ", "\n", "\nWe look forward to meeting you!    "], "images": [], "type": "part-time"},
{"text": "Pro Aire Design seeks Full Time HVAC Estimator / Estimating Assistant", "date": "2020-01-09 12:36", "compensation": "Negotiable", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-pro-aire-design-seeks-full/7052843065.html", "address": ["\n        ", "\ncompensation: Negotiable", "\nemployment type: full-time", "\nPro Aire Design is seeking a full-time HVAC Estimating Assistant ($15-22 an hour)", "\n", "\n*Please reference job title on subject, send resume in PDF, and text format on the body of email*", "\n", "\nWe are a company based in Brooklyn is looking for a HVAC Estimating Assistant with a 1-3 years' of experience in taking off a plans. Knowledge of drafting for HVAC metal shop, and coordination drawings in 2D/3D is a plus. The candidate should have knowledge of plumbing. The candidate will work in engineering department with professional. Compensation and benefits based on experience.", "\n", "\nMAJOR FUNCTION/ROLE", "\nWill work with project managers, and mechanical engineers to take off plans, create CAD files, and construction documents for HVAC projects. Additionally, keep track of incoming/outgoing products, purchase forecast, and return.", "\n", "\nJOB DUTIES", "\n• Take off plans + Performs computer-aided drafting and design work of considerable complexity. Incumbents at this level can work from verbal or written specifications.", "\n• Create 2D and 3D models using AutoCAD MEP", "\n• Prepare HVAC Shops, As-Builts and Coordination drawings", "\n", "\nEDUCATION AND EXPERIENCE", "\n• High school diploma (or equivalent) plus two years related experience; OR", "\n• An Associate Degree in a related technical field plus one years related experience;", "\n• Must have at least 1-3 years of experience in taking off plans and HVAC CAD preparation of Construction Documents, with additional experience preferred.", "\n", "\nPro Aire Design Offers:", "\n• Competitive wages", "\n• Medical benefits", "\n• Paid vacation", "\n• Paid holidays", "\n• Employee product discounts", "\n", "\nWe are an Equal Opportunity Employer; all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with a disability. If our company sounds like a place you want to be a part of please feel free to send your resume along with any inquiries. We look forward to hearing from you!    "], "images": [], "type": "full-time"},
{"text": "Part-Time / FREELANCE  OPPORTUNITY-for N.Y.I.T. Architecture students+", "date": "2020-01-09 14:06", "compensation": "$18.00 - to - $24.00 / hour - depending on skill and experience", "link": "https://newyork.craigslist.org/mnh/egr/d/part-time-freelance-opportunity-for/7052917796.html", "address": ["\n        ", "\n**ATTENTION:  all N.Y.I.T. Architecture and Urban Design Graduate Students, and recent graduates:", "\n", "\nPart-time, freelance architecture / urban design position available immediately", "\nfor", "\na SENIOR-LEVEL Architecture STUDENT, or Graduate-Level Urban Design STUDENT, ", "\nor RECENT GRADUATE", "\n", "\nSmall, creative, friendly design office environment, on West 30th Street, in Manhattan;  approx. 24-29 hours/week, on an hourly basis  (from $18 -to - $22./hour depending on experience and skills)", "\n", "\nWide variety of very interesting projects include: urban design, downtown revitalization, façade restoration, Landscape Architecture, and streetscape;  as well as architecture, residential, museums, healthcare, and commercial work, interiors, etc.", "\n", "\nMUST have an Architecture and/or Urban Design degree (or graduating soon)", "\nand must have excellent english - verbal & written skills", "\n*your cover letter should demonstrate this", "\n", "\nPlease NO \"CAD operators\", NO advanced/ or Senior-level architects, or anyone without specific architectural education and experience", "\n", "\nMust have excellent design and drafting / drawings skills, and computer skills including ACAD, SketchUp, 3D-Max, and PhotoShop, MS Word, Excel, PPT, InDesign, etc. ", "\n", "\nPlease send resume, and work sample", "\nThanks!", "\n    "], "images": [], "type": "part-time"},
{"text": "Structural engineer position available. Bilingual Russian preferred.", "date": "2020-01-09 15:44", "compensation": "Based on Experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-structural-engineer-position/7052994663.html", "address": ["\n        ", "\nStructural engineer position available.", "\nArchitectural Consulting Company is looking for a full time structural engineer which will work with planning and development of structural drawings, specifications for new and renovation of existing facilities, perform site visits, assisting a senior staff member in the completion of day to day projects. Strong understanding of NYC Building code is required however training will be provided. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. ", "\nPlease include resume and portfolio. Bilingual Russian preferred.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural drafter", "date": "2020-01-09 18:02", "compensation": "by job", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-drafter/7053089575.html", "address": ["\n        ", "\nLooking for a auto cad drafter to prepare construction plans for filling has to be fast & flexible hours  familiar with nyc building code & zoning    "], "images": [], "type": "part-time"},
{"text": "Architect/Designer", "date": "2020-01-09 16:12", "compensation": "Compensation commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/7053015487.html", "address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "], "images": ["https://images.craigslist.org/01111_gaz8wvs7ByI_600x450.jpg", "https://images.craigslist.org/00g0g_jDYofhdlyZr_600x450.jpg", "https://images.craigslist.org/00x0x_b0YNtzeGhjW_600x450.jpg", "https://images.craigslist.org/00l0l_ba9tKkfF3fQ_600x450.jpg", "https://images.craigslist.org/01010_9yRW0bTI4Ba_600x450.jpg", "https://images.craigslist.org/01111_3rdGpKVfJwx_600x450.jpg", "https://images.craigslist.org/00M0M_bg31Pw2wAox_600x450.jpg", "https://images.craigslist.org/00l0l_jiZu8SEJy6A_600x450.jpg", "https://images.craigslist.org/00t0t_dD1efPwvANu_600x450.jpg"], "type": "full-time"},
{"text": "Junior Construction Architect (Licensed or Unlicensed)", "date": "2020-01-09 15:41", "compensation": "Professional compensation that meets levels of education, experience, skills, compensation history.", "link": "https://newyork.craigslist.org/mnh/egr/d/jersey-city-junior-construction/7052992808.html", "address": ["\n        ", "\nSeeking full time LICENSED or UNLICENSED, JUNIOR or SENIOR CONSTRUCTION ARCHITECT.", "\n3 to 5+ years of architectural design, drafting, detailing & managing construction-related plans, drawings, documents for multifamily/mixed use projects, using AutoCAD, Revit and other tools.", "\n", "\nURBAN ARCHITECTURE LLC is a small ‘design/build’ architectural & civil engineering firm in Jersey City, working in-house with MANHATTAN BUILDING COMPANY, private developer/ builder of award winning projects in Hudson County, NJ.", "\nContinuing long term development, design, construction of mid/high rise luxury multifamily/ mixed use projects in historic neighborhood, incl. upgraded roads, sidewalks, streetscapes & parks.", "\n", "\nWork side by side with Chief Architect, licensed Architects, Civil Engineer, Civil Drafter-Detailer, Project Coordinator & construction mgmt. team. Offices directly adjacent to primary construction & civil roadwork and public park development sites.", "\n", "\nEXPERIENCE & OTHER REQUIREMENTS", "\n", "\n• U.S. experience in multifamily/mixed use construction architectural design, drafting, detailing & document mgmt; at least some (or significant) high rise / mid rise multifamily/mixed use experience are a big plus.", "\n", "\n• Must be legal U.S. resident, and currently live in or reasonable commute to Jersey City NJ.", "\n", "\n• Able to ‘hit the ground running’ on architectural design, construction drafting, detailing, document management, plans, elevations, details, sections, shop & coordination drawings, site plans, exterior/interior layouts, etc. with general knowledge of mid/high rise building codes.", "\n", "\n• Civil engineering drawing/detailing experience or exposure are a plus but not required.", "\n", "\n• Architectural or other relevant degrees or technical training should be all or significantly U.S. based.", "\n", "\n• Good writing & communication skills; prefers team interaction rather than solo setting; hard working, upbeat, pleasant.", "\n", "\nOPPORTUNITY & BENEFITS", "\n", "\n• True long term career opportunity; 5-6 years of primary project with other concurrent and future projects already in development.", "\n", "\n• Work with experienced, friendly, energetic team, in offices with construction mgmt, legal, finance, HR. Professional development via frequent industry ‘lunch & learns’, and office adjacent to primary construction & civil sites for site visits and work with construction managers.", "\n", "\n• Work hard but hours are reasonable.", "\n", "\n• Very competitive salary based on education, certifications, experience and skills, past salary history.", "\nHealth insurance, 401K, paid vacations & personal days.", "\n", "\nLEARN MORE: manhattanbuildingcompany.com    "], "images": [], "type": "full-time"},
{"text": "◄◄  SKETCHUP PROFESSIONAL AVAILABLE FOR YOUR 3D PROJECT", "date": "2020-01-10 10:32", "compensation": "Per Project Quote", "link": "https://newyork.craigslist.org/que/egr/d/astoria-sketchup-professional-available/7053384342.html", "address": ["\n        ", "\n", "    "], "images": ["https://images.craigslist.org/00a0a_l6bW4myiKco_600x450.jpg", "https://images.craigslist.org/00x0x_1gCNzoAdKas_600x450.jpg", "https://images.craigslist.org/00E0E_4lsaa5eQoDG_600x450.jpg", "https://images.craigslist.org/00101_3bp13nKYOb9_600x450.jpg", "https://images.craigslist.org/00N0N_iiDBD7DKCUq_600x450.jpg", "https://images.craigslist.org/00o0o_tMc4n4UWNM_600x450.jpg", "https://images.craigslist.org/01212_38rZsV5YzI_600x450.jpg", "https://images.craigslist.org/00S0S_he5jXxemWCY_600x450.jpg", "https://images.craigslist.org/00y0y_9j7z4QHkJmE_600x450.jpg", "https://images.craigslist.org/01111_ezFlwm02GKh_600x450.jpg", "https://images.craigslist.org/00404_2d7d7E4zm0v_600x450.jpg", "https://images.craigslist.org/00y0y_iw1zzHjErSs_600x450.jpg", "https://images.craigslist.org/00505_gFRMUdA5eYZ_600x450.jpg", "https://images.craigslist.org/00808_3FbJwrGs5WG_600x450.jpg", "https://images.craigslist.org/00B0B_jM2W8BA2MIT_600x450.jpg"], "type": "contract"},
{"text": "Draftsman", "date": "2020-01-09 16:39", "compensation": "$25-30", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-draftsman/7053034286.html", "address": ["\n        ", "\nFor 17 years, NY Loft, a custom architectural millwork and cabinetry company has run a home interiors showroom on 20th street in the Flatiron district of Manhattan working on custom luxury interiors. We work with both residential clients and real estate developers and focus on specialty projects. Many of our clients require custom finishes and craftsmanship that necessitate imports from all over the world. Currently we are working on projects by David Chipperfield Architects, ODA, Rockwell Group, Adjaye Associates, Pierre Yovanovitch, and Gilles & Boissier. ", "\n", "\nWe are seeking a skilled draftsman for immediate hire.", "\n", "\nWork will include:", "\n- Detailed shop drawings", "\n- Ability to use CAD strategically as a collaborative information management system that grows the company (Proficient use of blocks, layers, and Xrefs)", "\n- Analysis and interpretation of Architectural Drawings", "\n- In-depth understanding of how cabinets and millwork are built and installed", "\n- Ability to take detailed site measurements", "\n", "\nThe ideal candidate will be proficient in:", "\n- AutoCAD LT", "\n- Rhino", "\n- Excel", "\n", "\nWe are open to part time work with the right candidate. The hourly rate will be commensurate with experience. We strive for a reasonable work/life balance with regular hours of 10-6. There may be some occasional late days", "\n    "], "images": [], "type": "full-time"},
{"text": "ARCHITECT / DRAFTER", "date": "2020-01-03 08:45", "compensation": "Based on qualification", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-drafter/7048900445.html", "address": ["\n        ", "\nBusy Design and Consulting firm is looking for a talented individual to join our team.", "\n", "\nOur work includes renovations and ground ups of small, medium and large scale single and multi-family residential, commercial, community facility and mixed-use projects.", "\n", "\nResponsibilities will include production of design development and construction documents, Candidates must be self-motivated, reliable and able to manage all aspects of a project.", "\n", "\nCandidate Qualifications:", "\nBe familiar with NYC codes and zoning.", "\nKnowledge of construction materials, details and methods.", "\nProficiency in Revit and AutoCAD.", "\n", "\nWe are looking for highly motivated individuals who are willing to take on responsibility and grow with our team. Interested applicants must be quick to learn and adapt new drawing methods, related zoning & code rules, DOB and related agency requirements. detail-oriented, collaborative, and eager to take on challenges", "\n", "\nQualified individuals should submit a *brief description of your qualifications, *work samples, *starting salary requirements, in pdf or word format    "], "images": [], "type": "full-time"},
{"text": "Intermediate Architect", "date": "2020-01-10 11:58", "compensation": "Competitive Salary", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/7053451893.html", "address": ["\n        ", "\nGF55 Partners (www.GF55.com) seeks a talented and motivated full time Intermediate Architect for its NYC Office. Enjoy a stimulating and challenging team work environment with a variety of significant projects.  The position requires strong design, analytical and communication skills to interact with colleagues, clients and consultants.  GF55 offers an environment where professional growth and development is encouraged.", "\nGF55 seeks excellence by a collaborative search for the best solution in the creation of architecture ", "\n", "\nSkills Required ", "\n•\tRevit, Cad, Sketchup, Photoshop, In Design and MS Office Suite", "\n•\tStrong Analytical skills, and good follow through ", "\n•\tAbility to collaborate and work independently ", "\n•\tBachelor's Degree in Architecture or higher", "\n•\tAuthorized to work in the US", "\n•\t1-3 years of relevant experience ", "\n", "\nCompensation commensurate with qualifications. GF55 pays a competitive salary with benefits. ", "\n", "\nInclude in your application:", "\n•\tCover Letter", "\n•\tResume ", "\n•\tWork Samples", "\n    "], "images": [], "type": "full-time"},
{"text": "Junior Architect", "date": "2020-01-10 13:35", "compensation": "based on experience/Hourly", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect/7053536705.html", "address": ["\n        ", "\nJunior Architect (Upper West Side)", "\n", "\ncompensation: Commensurate with experience", "\nemployment type: Part Time", "\nSmall Architectural / Interior Design firm located in the Upper West Side, specializing in residential and commercial projects, seeks talented Junior Architect. Work will consist of assisting in all phases of schematic design, development, preparation of DOB drawings and applications, construction documents, construction site visits, archiving and general office activities. Candidates must be highly motivated, quick learners, with a passion for architecture and desire to learn and grow. Excellent AutoCAD drafting abilities and 3D rendering are a must. Candidates must be responsible, organized, punctual, reliable, have good communication skills, and be team-players, capable of multi-tasking and focused on producing accurate results.", "\nPlease reply ONLY if you:", "\n1. Previous working experience in an Architectural firm is a plus", "\n2. send pdf work samples of similar work ONLY", "\n3. send a cover letter and your resume", "\n4. indicate your availability You reply must include response to all 4 requirements", "\n", "\nPlease send email to career@43hundred.com    "], "images": [], "type": "part-time"},
{"text": "architect/interior designer", "date": "2020-01-10 14:21", "compensation": "The salary is based on level of experience.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-interior-designer/7053575686.html", "address": ["\n        ", "\nArchitect/ Interior Designer", "\nRADU ARCHITECTS is seeking full-time/part time architect with 3-5 years architecture & design Interior  experience. Experience in all aspects of design and production. Candidate must be able to manage more than one project at one time varying in size.", "\nCandidate should have experience in dealing with clients.", "\nCandidate should have good design sense and be knowledgeable in construction documents. The Architect will be responsible for all or some of the project phases such as; Schematic Design, Design Development, Construction Documents, Custom Millwork Detail and Shop Drawings Review.", "\nPrerequisites:", "\n1.\t3-5 years’ experience working for a NYC Architectural Firm/ Interior Design firm.", "\n2.\tProficient in producing CD’s ", "\n3.\tProject Management/Consultants coordination.", "\n4.\tClient relations experience", "\n5.\tGood design sense.", "\n6.\t Knowledge of NYC building codes and NYC zoning.", "\n7.\tNY Professional License a plus.", "\nCandidate Qualifications:", "\n1.\tExcellent oral and written communication skills.", "\n2.\tProficient in creating coordinated construction document sets.", "\n3.\tResolves technical and code issues.", "\n4.\tProduce Schematic Design Proposals.", "\nIf qualified, please email resume ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Freelance Architect", "date": "2020-01-10 16:27", "compensation": "Compensation is Fee-based", "link": "https://newyork.craigslist.org/fct/egr/d/mamaroneck-freelance-architect/7053676544.html", "address": ["\n        ", "\nRemodeling Consultants Inc., a Westchester and Fairfield Design Build Firm, is seeking an experienced free-lance Architect.  ", "\n", "\nCandidate will work directly with in-house Design Consultants and Sr. Architect to prepare construction drawings including floor plans, interior and exterior renovations. ", "\n", "\nCandidate must have at least five years of experience with AutoCAD and Residential Construction. Compensation is fee-based. ", "\n", "\nPlease forward resume with your contact information to this ad", "\n    "], "images": [], "type": "contract"},
{"text": "Millwork Draftsman Position", "date": "2020-01-10 16:01", "compensation": "tbd based on experience", "link": "https://newyork.craigslist.org/brk/egr/d/woodhaven-millwork-draftsman-position/7053656758.html", "address": ["\n        ", "\nBusy woodworking shop located in Brooklyn NY (Cypress Hills area) is looking for a full time in-house draftsman with minimum 5 years of experience in AutoCAD and high-end residential millwork drawings for production.  Please send your resume and if possible, samples of previous work.    "], "images": [], "type": "full-time"},
{"text": "Freelance Architect", "date": "2020-01-10 16:26", "compensation": "Compensation is Fee-Based", "link": "https://newyork.craigslist.org/wch/egr/d/mamaroneck-freelance-architect/7053675609.html", "address": ["\n        ", "\nRemodeling Consultants Inc., a Westchester and Fairfield Design Build Firm, is seeking an experienced free-lance Architect.  ", "\n", "\nCandidate will work directly with in-house Design Consultants and Sr. Architect to prepare construction drawings including floor plans, interior and exterior renovations. ", "\n", "\nCandidate must have at least five years of experience with AutoCAD and Residential Construction. Compensation is fee-based. ", "\n", "\nPlease forward resume with your contact information to this ad.", "\n    "], "images": [], "type": "contract"},
{"text": "Architect - Project Manager", "date": "2020-01-10 16:40", "compensation": "TBD", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-project-manager/7053686621.html", "address": ["\n        ", "\nBDF Design is seeking experienced drafter-Architect, from schematic design to preparation of DOB filings.", "\nRequires to have a good understanding to zoning & code rules, DOB and related agency requirements.", "\n", "\nQualifications:", "\n- Proficient in Revit and Auto CAD a must.", "\n- Strong communication and organization skills.", "\n- Being familiar with NYC Code and Zoning rules.", "\n", "\n- A professional degree in architecture", "\n", "\nPlease email:", "\n• Resume in PDF format.", "\n• Work samples/portfolio attached in PDF format/or viewable online.", "\n• Compensation requirements.    "], "images": [], "type": "full-time"},
{"text": "Facade / Building Envelope Architect", "date": "2020-01-10 17:55", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/7053739977.html", "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2-5 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "], "images": [], "type": "full-time"},
{"text": "Trainee Project Manager at High-End Glass Wall Company", "date": "2020-01-10 18:02", "compensation": "$3750/month", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-trainee-project-manager-at/7053744607.html", "address": ["\n        ", "\nHi! Thanks for your interest, please check out the details below, and if it seems like the right position for you, feel free to reach out with any questions:", "\n", "\nJOB DESCRIPTION", "\nWing Partners is looking for an energetic person to join our training program to become a Project Manager. No project management experience is necessary to join as a trainee. You'll learn everything from experienced project managers who manage multi-million dollar projects, building workplaces for fortune 500 companies. We specialize in glass wall systems for office interiors. (Check out our website for photos www.wingpartners.com). Please note that this is not a design role, and you should have some architecture, engineering or construction training.", "\n", "\nYou will be consulting with designers on the customization capabilities of our wall systems and coordinating the build-out of our clients' designs. You will interact with architects, especially during the drafting of shop drawings and submitting finish samples for approval. You'll assist our Project Managers in the office and in the field on active jobsites with reviewing bid requests, drafting and submitting shop drawings, and following the entire project timeline from bidding to completion.", "\n", "\nRESPONSIBILITIES", "\n* Review construction documents, put together bid packages", "\n* Develop shop drawings in AutoCAD (or Revit if you know it)", "\n* Field verification measurements", "\n* Attend construction coordination meetings", "\n* Assist with scheduling of deliveries and supervision of installers", "\n", "\nREQUIREMENTS", "\n* Proficiency in AutoCAD, Excel and Word. ", "\n* Experience with Revit is a plus, but not required.", "\n* Be able to read and understand construction documents", "\n* Must be able to communicate with clients as well as general contractors and field labor.", "\n* Self-driven, detail oriented, well organized.", "\n* Located in the NYC metro area", "\n", "\nCOMPENSATION AND TIME", "\n40 hours per week, with a salary paid bi-weekly. Typical hours are 9am-6pm, with occasional meetings starting at 8am. Training program lasts 90-180 days depending on performance. Health benefits are available after a waiting period of 60 days. With excellent performance you'll graduate from Trainee to full Project Manager, which includes a pay raise.", "\n", "\nABOUT US", "\nWing Partners is a full-service distributor of modern, high-end customized glass wall systems. We work closely with architects and interior designers to help them achieve their visions for the workplaces of clients such as IBM, Under Armour, AMC, Heineken, Coach, NBA, Nike, and many more. At Wing Partners, we're a small tight-knit group who works hard and likes to have fun. We're based in Chelsea, New York City.", "\n", "\nCONTACT", "\nCheck out our website at WingPartners.com. To apply, please email Michael with your resume/cv, cover letter and 'your name - Wing Partners' in the subject. Thanks!    "], "images": [], "type": "full-time"},
{"text": "Architects - Residential Experience", "date": "2020-01-11 18:06", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architects-residential/7054365796.html", "address": ["\n        ", "\nArchitects: 10-12 Years Experience", "\n", "\nArchitectural design firm based in Manhattan has immediate opening for suitably qualified, self-motivated architects having approx 10-12 years post graduate experience, primarily in residential architecture. ", "\n", "\nEligible candidates must have experience in the design and documentation of custom, high-end residential projects including landmarked townhouses, new homes and private estates and/or the renovation of existing structures. Prior experience with DoB Applications and with Landmarked or historic properties is a plus.  Candidate must be familiar with the NYC Building Code, should have excellent planning skills and, as well as knowledge of fine materials and their detailing.  ", "\n", "\nAcceptable candidates should have:", "\n•\tcompleted an architectural degree program;", "\n•\tapproximately 10-12 years design and construction documentation experience;", "\n•\tprior experience with construction documentation for residential projects, including millworking;", "\n•\textensive familiarity with New York City and New York State Building Codes;", "\n•\tAutoCAD (3D skills are a plus, but not mandatory);", "\n•\tUS citizenship or established Visa / Work Permit.", "\n", "\nE-mail professional resume with brief cover letter stating comparable experience only. Please note that resumes from recent graduates, over-qualified and/or overseas respondents will not be reviewed for this position.    "], "images": [], "type": "full-time"},
{"text": "Facade / Building Envelope Project Manager", "date": "2020-01-10 17:53", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project-manager/7053738995.html", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer or architect with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us as a Project Manager  in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "], "images": [], "type": "full-time"},
{"text": "CAD Drafter", "date": "2020-01-12 11:03", "compensation": "$15 - $30 per hour. Compensation based on experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-cad-drafter/7054622360.html", "address": ["\n        ", "\nWe are Engineering Firm located in Brooklyn, NY, are seeking a Full-Time experienced CAD Drafter. We focus on Structural Engineering design and this position requires excellent AutoCAD skills. You will report to the lead engineer and occasionally go on site visits. Someone who is knowledgeable in strength of materials, steel design, and concrete design would be perfect for this position.", "\n", "\nJob Requirements:", "\n- Excellent AutoCAD skills and able to do drawings, read and interpret construction plans and specs. ", "\n- Knowledge of Microsoft Office, Adobe Acrobat Pro.", "\n- Detail oriented to draft new projects and modify existing drawings.", "\n- Clear communication with coworkers and clients.", "\n- Self-motivated, fast learner and willing to put in extra hours when needed.", "\n", "\nWe Offer:", "\n- We offer an excellent work environment, competitive salary (commensurate with experience).", "\n- Paid vacation, paid holidays, and optional health insurance.", "\n", "\nWe are a small company, but we work on many projects. There are very good opportunities to grow and learn with this company for a dedicated employee.", "\nForeign engineers/architects are welcome! Knowledge of Russian language is plus.", "\n", "\nNo students, no part-time, no freelancers. Don't waste your time or ours please.", "\n    "], "images": [], "type": "full-time"},
{"text": "MASTER  PLUMBER  - SIGN OFF -  ARCHITECT", "date": "2020-01-12 12:28", "compensation": "OPEN", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-master-plumber-sign-off/7054672905.html", "address": ["\n        ", "\nWELL  ESTABLISHED  HEATING  COMPANY  SEEKS", "\nMASTER  PLUMBER ,  OR  ARCHITECT  FOR  ", "\n PROCESSING  VARIOUS  APPLICATIONS AND", "\nBOILER  INSTALLATION  REQUIREMENTS INCLUDING", "\nSIGN  OFF AT   INSTALLATION  COMPLETION.", "\nPLEASE  CONTACT US  VIA  EMAIL  OR  CALL", "\n718--288--7789    "], "images": [], "type": "employee's choice"},
{"text": "Drafting/Estimating Internship", "date": "2020-01-13 10:29", "compensation": "Unpaid Internship", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-drafting-estimating/7055165570.html", "address": ["\n        ", "\nOur company is offering an internship for recent graduates/college students with Architectural, Construction Management or Engineering background and interested in real world experience in the Manufacturing Industry.", "\n", "\nWe are a top fabricator in the Northeast for custom metal facade and roofing components. Our Design & Estimating Department are looking for an individual who is interested in the business, design and developmental aspects of architecture. ", "\n", "\nThe internship program provides a unique opportunity to gain experience in:", "\n-\tCost Estimation", "\n-\tSpecs & CD", "\n-\tMarketing Strategy and PR", "\n-\tFabrication", "\n-\tInstallation and Field Relationship", "\n", "\nWe are looking for interns who are:", "\n-\tSelf-motivated and able to receive/ use constructive criticism", "\n-\tCommunicative; willing to ask questions, share their ideas ", "\n-\tTeam Players willing to work with others", "\n-\tPunctual, reliable and responsible", "\n-\tInterested in architectural methods/materials in Roofing/Facade", "\n", "\n", "\nCandidates must have knowledge of Microsoft Office, AutoCad, experience in Rhino is a plus! ", "\nInterns must be present 20 hrs/week for 3 Months. Full time positions are available for best candidates.", "\n", "\nThis is not a paid internship however; a lunch and 75% travel stipend will be provided.", "\n", "\nPlease send a resume and work samples to Craigslist email listed.    "], "images": [], "type": "part-time"},
{"text": "Project Coordinator/Manager", "date": "2020-01-13 10:59", "compensation": "65,000-100,000 based on prior experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-project-coordinator-manager/7055188275.html", "address": ["\n        ", "\nBrooklyn based Expediting company seeking an experienced full-time NYC Project Coordinator/Manager, Our office offers a fun and energetic environment with room for professional growth.", "\n", "\nWe are explicitly looking for someone that already has experience with the NYC Department of Buildings and possesses a valid Class 2 Filing Representative License.", "\n", "\nResponsibilities will include the following:", "\n- Coordinating, communicating and meeting with clients, professional consultants, and DOB personnel.", "\n- Preparation & filing of all application types including DOB Now.", "\n- Acquiring work permits.", "\n- Code and zoning research.", "\n- Attending plan exams.", "\n- Violation removal with DOB/ECB and FDNY.", "\n- Attending inspections.", "\n", "\nCandidates Qualifications:", "\n", "\n- Ability to communicate with clients and professional consultants", "\n- Knowledge of NYC filing, permitting and sign-off procedures", "\n- Ability to read architectural and engineering drawings", "\n- Excellent communication skills", "\n- Strong organization skills", "\n- Self-motivated", "\n- Be fluent in English", "\n- Punctuality is a must", "\n- Be able to work with a team", "\n- A fun, energetic approach to work and business interactions.", "\n", "\nQualified individuals should:", "\n", "\nSubmit PDF resumes (not to exceed 5 MB)", "\nProvide salary requirements in the body of your cover letter.", "\n", "\nWe are ready to hire you today if you qualify and have the experience we are looking for.", "\n", "\n**** If you do not possess a Class 2 Filing Rep Status, have knowledge of required DOB/DEP/Landmarks and FDNY forms, and you cannot read a set of drawings, please do not apply for this job. We will ask you questions pertaining to forms and applications.", "\n", "\nWe look forward to hearing from you.", "\n", "\nThank you.    "], "images": [], "type": "full-time"},
{"text": "Architect -Full Time-Immediate Hire", "date": "2020-01-13 12:16", "compensation": "Depending on Experience Level", "link": "https://newyork.craigslist.org/stn/egr/d/architect-full-time-immediate-hire/7055253240.html", "address": ["\n        ", "\nAt GLA we are always looking for talented, educated, experienced, and passionate people to join our team. If you have a desire to be involved in a diverse Architecture Firm then GLA is a perfect work environment for you.", "\n", "\nWe are currently looking for an individual with 1 or 2 years of Professional Practice in an Architects Office.", "\n", "\nWe invite you to contact us, tell us a little about yourself, your experiences, education, and directional drive. We look forward to welcoming you and expanding our GLA team with new diverse talent.", "\n", "\nOur projects vary in size and complexity, ranging from Single Family Residential to High-Rise Buildings in Manhattan.", "\n", "\nPosition would entail assisting in preparation of architectural design and construction documents including plans, elevations, sections, details, schedules, correcting and updating drawings and preparing design presentations including renderings and related design graphics. Responsibilities will also include assisting in administration of various projects from inception thru completion, drafting, field surveying, research of project specific components, code analysis, coordination with sub-consulting engineer teams, assisting with response to Requests for Information, and general office support of principal and project managers.", "\n", "\nStrong Graphic Skills in AutoCAD is required and proficiency in Adobe Creative Suite, Revit, Sketchup and Microsoft Office is desired. Candidates are required to have a Bachelors or Master's Degree in Architecture from an NAAB Accredited Program.", "\n", "\nThis position offers excellent growth opportunity and a competitive salary. GLA provides candidates with an excellent opportunity to work in a collaborative design-oriented open studio environment. ", "\n", "\nCandidates shall be a current resident of New York or New Jersey.", "\n", "\nNo Phone Calls Please- Apply as Follows:", "\n", "\nQualified applicants should address their CV, portfolio in PDF format and queries to: studio@GL-Arch.com", "\n", "\nGLA is an Equal Opportunity Employer.    "], "images": [], "type": "full-time"},
{"text": "Project Architect(s)", "date": "2020-01-13 11:13", "compensation": "Commensurate with Experience", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/7055199575.html", "address": ["\n        ", "\nMssa, a Small Successful 8-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "], "images": ["https://images.craigslist.org/00P0P_a9Ug9tajpXp_600x450.jpg", "https://images.craigslist.org/01010_jFSM8p3TNKY_600x450.jpg"], "type": "full-time"},
{"text": "Assistant Project Manager - Construction and Development", "date": "2020-01-13 18:04", "compensation": "$65,000 - $75,000", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-project-manager/7055529682.html", "address": ["\n        ", "\nJob Description:", "\n", "\nLevel One Holdings is a vertically integrated company specializing in the acquisition, design and development of unique real estate assets. As the Owner, Developer and General Contractor, we shepherd every project from architectural and zoning feasibility studies, to design development, through construction, to completion.", "\n", "\nThis role is ideal for someone with experience in residential group up construction and construction management. Our ideal candidate is a positive, outgoing individual who is a team player, self-driven and extremely detail oriented. The candidate should be prepared to work in a small team that is very hands on.", "\n", "\nResponsibilities", "\n", "\n- Review of plans and specifications to understand the scope of the project", "\n- Perform take-offs and level construction bids", "\n- Draft detailed scopes of work to be used in the negotiations with subcontractors or suppliers", "\n- Participate in project value engineering and purchasing", "\n- Coordinate the timely submission and review of project submittals, RFIs and shop drawings", "\n- Manage project information and documents on the company share file system ", "\n- Work with the project expediter to manage filings, amendments and permitting", "\n- Review subcontractor and vendor invoices, change orders and requisition", "\n- Work with the Senior Project Manager and Field Superintendent to update the project Schedule on a weekly basis", "\n", "\nExperience and qualifications:", "\n", "\n- MUST have a minimum of 3 years experience in New York City residential ground up construction management ", "\n- Experience either working as an assistant project manager or project architect", "\n- Must be able to read plans, construction drawings and shop drawings", "\n- Knowledge in Autocad and/or Bluebeam", "\n- Understanding of the NYC Dept of Buildings permitting and project closeout process", "\n- Strong organization and time management skills", "\n- Strong written and oral communication skills", "\n", "\nBenefits:", "\n", "\n- Health Insurance", "\n- Incentive bonuses", "\n- Vacation Pay    "], "images": [], "type": "full-time"},
{"text": "JUNIOR ENGINEER / ARCHITECT", "date": "2020-01-14 10:23", "compensation": "Salary", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-engineer-architect/7055826729.html", "address": ["\n        ", "\nJUNIOR ENGINEER / ARCHITECT", "\n", "\nFounded in 1987, RAND Engineering & Architecture, DPC is a 100-person Manhattan-based firm that designs, specifies, and administers restoration, upgrade, and adaptive re-use programs on behalf of owners, managers, and co-op and condo boards.", "\n", "\nWe are currently seeking an engineering or architectural graduate to prepare specifications and reports on exterior facade and roofing repair/restoration projects. ", "\n", "\nResponsibilities include but are not limited to:", "\n•\tManage projects, with project manager, from start to finish including design scope, City approval process, bidding, construction documents and construction administration", "\n•\tAct as point person for clients, contractors, consultants, vendors and in-house tea", "\n•\tPrepare project progress reports", "\n•\tComplete design drawings in AutoCAD", "\n•\tWork with senior staff to create and deliver client presentations", "\n•\tWork with contractor to resolve issues encountered in the construction process", "\n", "\nQualifications", "\n•\tB. or M. in Architecture or Engineering", "\n•\tConstruction Administration field experience as plus.", "\n•\tAbility to work well under pressure, juggle and prioritize multiple projects and adjust work accordingly, often against tight deadlines. Strong organizational skills", "\n•\tAbility to interact with team members including, external client organizations and vendors.", "\n•\tPursuing professional certifications or licensure a plus.", "\n•\tPositive attitude with proven proficiency working collaboratively within a team setting.", "\n•\tStrong work ethic, ability to work efficiently and with accuracy, takes responsibility for own work.", "\n•\tSelf-motivated individuals capable of assuming increasing responsibility for both current and future projects, and who are interested in growing with the firm.", "\n", "\nUnsolicited resumes from third party agencies will not be accepted.   ", "\n", "\nRAND Offers a comprehensive benefits package that features health and dental coverage, a company sponsored vision plan, 401(k) retirement plan with company match, long-term disability, life-insurance, educational opportunities, transit and parking exemptions, employee gym on site, yoga, kickboxing, personal trainer, employee referral program, career development, casual Fridays, and holiday parties. In 9 different years, (including 2019), RAND has been voted one of  Crain’s Top 100 Places to Work in NYC.", "\n", "\nApplicants should send cover letter, resume, writing samples, and salary requirements to hr@randpc.com. Please reference ad F&R2020. ", "\nwww.randpc.com    "], "images": [], "type": "full-time"},
{"text": "Project Architect Wanted in Industry City", "date": "2020-01-14 12:09", "compensation": "DOE", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-project-architect-wanted-in/7055908472.html", "address": ["\n        ", "\nProject Architect wanted in Industry City, Brooklyn.", "\nOpportunity for participation in projects ranging from multi-family to academic institutional buildings.", "\n", "\nQualifications:", "\n•\t2 to 4 years of work experience", "\n•\tWill be involved in projects at all stages of design from planning to construction", "\n•\tProficiency in Autodesk Revit is required", "\n•\tFull-time or consultant", "\n•\tMust be eligible to work legally in the U.S.", "\n ", "\nPlease email resume and work samples for consideration. We are looking forward to hearing from you.", "\n    "], "images": [], "type": "full-time"},
{"text": "Assistant for busy CEO of high end prefab start up (Russian&English)", "date": "2020-01-14 08:11", "compensation": "DOE", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-for-busy-ceo-of-high/7055757186.html", "address": ["\n        ", "\nA growing start-up that develops and manufactures high end green prefabricated houses with innovative engineering systems and smart home technologies is seeking an experienced motivated assistant. ", "\nMust be fluent with both Russian and English. Business background or understanding of architecture and engineering are plus.", "\n", "\nWe are looking for someone who can work independently and confidently under pressure. Creativity, resourcefulness, and multi-tasking skills are required.", "\n", "\nThe Personal Assistant will maintain a calm, relaxed presence while providing first-class operational oversight in a fast-paced and fast-moving environment. They embody solid communication skills and an eye for detail with a polished and professional style.", "\n", "\nThe candidate also must have a high level of discretion while maintaining a strong sense of urgency and sound judgment. This position requires the ability to anticipate the next steps, solve problems and be willing to take on anything to make the CEO’s life easier.", "\n", "\nThe candidate will also help us out with various projects related to the business, communicating with our engineering team and putting together the drawing, giving the drawings to the suppliers and manufacturers in order to get quotes for the materials; running errands, conducting research, creating presentations and preparing reports, organizing and maintaining files, answering and making calls as well as finding and communicating with other contractors that will take on new tasks in the organization.", "\n", "\nOther duties as follows:", "\n• Act as point of contact;", "\n• Provide systematic and dependable follow-up;", "\n• Handle confidential information with discretion.", "\nSkills:", "\n• A background or understanding of architecture or engineering is a big plus;", "\n• Previous experience supporting executives;", "\n• Knowledge and proficiency in the following software applications:", "\nMicrosoft Word, Excel, PowerPoint, and Outlook.", "\n• Strong written and verbal communication skills;", "\n• Strong organizational skills;", "\n• Ability to prioritize and multitask;", "\n• Must have confidence;", "\n• Great interpersonal skills including the ability to think and act strategically, provide sound judgment", "\n• Highly resourceful team-player, with the ability to also be extremely effective independently.", "\n", "\n", "\nThis is a paid contract position with a test period that will last up to 3 months before hiring full time.", "\nApplicants should be at least 18 years old and live within New York City. They also must be organized, fluent in English and Russian, and highly dependable. Interested applicants should send a resume and cover letter saying why you are the best candidate for this job. When sending your resume please write 'your full name for an assistant position' in the subject line of the email. We are looking forward to hearing from you!    "], "images": [], "type": "contract"},
{"text": "Junior Architect/ Estimator", "date": "2020-01-14 13:17", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/astoria-junior-architect-estimator/7055965972.html", "address": ["\n        ", "\n", "\nWoodwork Shop is seeking F/T Junior Architect/Estimator. Individual must have experience reading and understanding architectural drawings and specifications. Send resume to interior@nycmillwork.com or call at 718-392-5948.", "\n    "], "images": [], "type": "full-time"},
{"text": "AutoCad Drafter - MEP Engineering", "date": "2020-01-14 14:44", "compensation": "Salary based on experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-autocad-drafter-mep-engineering/7056037024.html", "address": ["\n        ", "\nAndrew Katz Engineering PLLC is actively seeking a highly motivated individual proficient in AutoCAD.", "\n", "\nLooking for a candidate who is﻿ eager to learn, enthusiastic and interested in engineering practices and design. This is a great opportunity for someone looking to get into the field at an entry level position and learning on the job.", "\n", "\nJob entails:", "\n- prepare drawings for design team", "\n- visit job sites and mark up drawings with existing MEP, SP, FA conditions", "\n- assist with the design of MEP, SP, FA systems.", "\n- possibility of obtaining NYC DOB Expeditor license and go to DOB as required", "\n", "\nQualifications and Skills:", "\n- completely proficient in AutoCad, having a skill level equivalent to a draftsman", "\n- able to work well with a team", "\n- ability to work in a multi-task environment", "\n- driver's license required", "\n", "\nAt Andrew Katz Engineering PLLC we pride ourselves on being an innovative and professional team, building strong, trusting and collaborative relationships with our clients for the past 30 years.  We specialize in mechanical, electrical, plumbing, sprinkler and fire alarm engineering work.  Founded by Andrew Katz, PE, the company has grown into a partnership with his son, David Katz, PE.  Andrew Katz Engineering PLLC is a fast growing company and continues to build our team and business, providing rewarding careers and opportunities for our employees.    "], "images": [], "type": "full-time"},
{"text": "Draftsman/estimator/assistant project manager.", "date": "2020-01-14 15:49", "compensation": "T.B.D.", "link": "https://newyork.craigslist.org/que/egr/d/draftsman-estimator-assistant-project/7056086983.html", "address": ["\n        ", "\nWe are currently seeking a person for full time position as a draftsman/estimator/assistant project manager. We specialize in installation of; windows, glass doors, glass partitions, glass railings, shower enclosures, mirrors and ornamental metals. Knowledge in glass and metal trade not required but helpful. A person must have general knowledge in construction, must know how to read architectural drawings and be able to develop shop drawings using AutoCad. Prior work experience with QuickBook and Excel very helpful.  Please call from 8am-5pm.    "], "images": [], "type": "full-time"},
{"text": "Construction APM / Administrator Role", "date": "2020-01-14 16:15", "compensation": "Based on Experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-apm-administrator/7056106668.html", "address": ["\n        ", "\nJoin a team that is driven by excellence, integrity, passion and dedication. Streamline Construction goal is to continually encourage our employees to go beyond expectations.", "\n", "\nWe are currently seeking an APM / Office Administrator to support the project team in our office located in Brooklyn, NY 11232. Flexibility, intelligence, attention to detail, organizational skills, customer service skills and excellent judgment will be critical to your success.", "\n", "\nPRIOR CONSTRUCTION KNOWLEDGE IS A MUST!", "\n", "\nIdeal Candidate:", "\n", "\nAutoCad (Preferred but not required) ", "\nConstruction Software ", "\nFamiliar with RFI & Submittal Process", "\nAccounting Knowledge", "\nConstruction Background ", "\nAdministrative Duties ", "\n", "\nThis position will provide a great opportunity for a long‐term thinker to exhibit administrative expertise across a range of markets and clients, leverage technology to increase efficiency and effectiveness, participate in a broad range of project planning and coordination duties, and grow with the company.", "\n", "\nIf you are interested in the position, please send us your resume for consideration. For more information about the company you can check out our website ", ".    "], "images": [], "type": "full-time"},
{"text": "Architectural Senior Drafter/Job Captain", "date": "2020-01-15 11:40", "compensation": "salary commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-senior-drafter/7056525899.html", "address": ["\n        ", "\nSBLM New York is looking for a highly motivated Senior Drafter/Job Captain who has a passion for understanding weather related problems that occur on existing older buildings.", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters as required", "\nProduce deliverables without requiring constant supervision", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3 or more years’ experience in an Architect’s office", "\nMust be proficient in AutoCAD, Revit and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction administration ", "\nExperience working with exterior envelope", "\nPositive attitude and driven to succeed", "\n", "\n. Compensation and Benefits:", "\n•\tWe offer an excellent benefit package", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n•\tSalary commensurate with level of experience", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n•\tCreative and innovative work environment", "\n.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Senior Drafter/Job Captain in the subject. No phone calls, please. ", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Architectural Junior/Senior Drafter", "date": "2020-01-15 11:48", "compensation": "salary commensurate with experience", "link": "https://newyork.craigslist.org/lgi/egr/d/huntington-station-architectural-junior/7056532602.html", "address": ["\n        ", "\nSBLM Long Island branch office of NYC based Architectural firm seeks motivated and talented Junior through Senior Architectural Drafter (Architect in Training).", "\n", "\nRequirements:", "\n• BA Arch or BS Arch degree required", "\n• AutoCAD required (basic test at interview) Revit a plus", "\n• 2 to 7 years’ experience working in Architects office", "\n• Excellent communication skills with ability to work well under deadlines", "\n", "\nCompensation and Benefits:", "\n• We offer a competitive salary, excellent benefits package and a creative, innovative work environment.", "\n• Our benefits include Medical/Dental/Vision, 401K Plan, Personal Time Off, Paid Holidays, Flexible Spending Plans and more.", "\n• Company Culture: learning and growth opportunities, rewarding projects, free educational ongoing learning", "\n", "\nInterested candidates should forward their cover letter and resume", "\nPlease include “Architectural Drafter in subject line. No phone calls, please.    "], "images": [], "type": "full-time"},
{"text": "Registered Architect", "date": "2020-01-15 12:59", "compensation": "negotiable", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-registered-architect/7056591833.html", "address": ["\n        ", "\nLooking for two  Registered Architects for setting a new  branch of architectural office in Manhattan with projects worldwide.    Letter of  Intent  already secured for four projects  . Hand sketching skill and modelling software experience required.  Preferable Ivy League Graduates with writing knowledge of Mandarin and Turkish language", "\n", "\nRespond to advertisement number, each  e-mail will get response immediately.", "\n    "], "images": [], "type": "full-time"},
{"text": "Junior Architect/Draft person", "date": "2020-01-15 15:09", "compensation": "open depending on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-draft-person/7056696382.html", "address": ["\n        ", "\nArchitectural and Engineering firm seeking  Junior Architect/Draft person.", "\nSelf-motivated individual who will interact with our clients .  ", "\nIndividuals should be able to draft floor plans elevations, details and prepare architectural construction documents,", "\nCandidates should be able to work as part of a team as well as independently with limited guidance from senior staff. ", "\nApplicants must have a professional Bachelor's degree from an accredited university.", "\nApplicants must be proficient in AutoCAD, Adobe package, Microsoft Office softwares and 3DSMax.  ", "\n", "\nRequirements: ", "\n•min. 5 years of experience using AutoCAD", "\n", "\n•Bachelor's degree related to architectural / engineer ", "\n•Experience with MS Office Suite (Word, Excel, Outlook, and Adobe Acrobat) preferred, InDesign and Photoshop a plus ", "\n•Must be able to understand drawing standards in an architectural setting ", "\n•Highly organized ", "\n•Good verbal and written communication skills ", "\n•Strong attention to detail ", "\n•Ability to self-direct and work independently or with limited supervision", "\n", "\n•\tMust be legally authorized to work in the US", "\n", "\n", "\n", "\nTo Apply:", "\nPlease e-mail your cover letter and resume to the above e-mail with the Junior Architect/Draft person Position. No phone calls, email only.", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Midtown Architecture Office searching for an Architecture Candidate", "date": "2020-01-15 14:55", "compensation": "Compensation will be based on experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-midtown-architecture-office/7056685398.html", "address": ["\n        ", "\nSmall Midtown Architecture Office searching for a talented architectural candidate to assist on multiple projects. Immediate placement possible.", "\n", "\nOur primary focus is hospitality, but our work range from small restroom renovation to master planning.", "\n", "\nCandidate should have initiative, be motivated, intelligent, organized, articulate, be project motivated, and be responsible.", "\n", "\nJob Description: Work with Principal Architect on all aspects of the projects based on abilities. Work may include design, drafting, research, code review, site visits, surveys, general office work etc. ", "\n", "\nRequirements:", "\n* Degree from accredited architecture school", "\n* 2 - 5 years of work experience (Highly preferred) ", "\n    (less experienced candidates will be considered if they have DOB or General Contracting", "\n     experience.)                                                                           ", "\n* In the process of obtaining architectural licensure", "\n* Experience with construction documents", "\n* AutoCAD Proficiency", "\n* Functional Experience with SketchUp, Adobe software, MS Office Suite & other software", "\n* Ability to clearly communicate verbally and in writing", "\n* Ability to complete tasks with accuracy and with strong attention to detail.", "\n* Ability to consistently be punctual and meet deadlines", "\n", "\nAdditional items that would be beneficial to the job:", "\n*DOB ID and Building Department experience ", "\n* Experience and knowledge of NYC Building Codes.", "\n* Ability to work independently", "\n", "\nThis is a great opportunity for a young aspiring architect to learn how to successfully complete jobs from start to completion. ", "\n", "\nPlease reply with:", "\n1) Cover letter", "\n2) Resume", "\n3) Work samples (Portfolio may be used in lieu of work samples for less experienced candidates)", "\n4) Your salary goals and availability to start work", "\n5) Legal work status", "\n", "\nNote: References will be required and verified after interview", "\n    "], "images": [], "type": "full-time"},
{"text": "Drafters Needed", "date": "2020-01-15 17:39", "compensation": "Based on experience", "link": "https://newyork.craigslist.org/que/egr/d/east-elmhurst-drafters-needed/7056803202.html", "address": ["\n        ", "\nCivil Engineering company is looking for experienced drafters to work remotely.", "\nAutoCAD experience required.    "], "images": [], "type": "employee's choice"},
{"text": "Maintenance Technician", "date": "2020-01-16 13:29", "compensation": "DOE", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-maintenance-technician/7057250493.html", "address": ["\n        ", "\n\n\n\n", "\n    "], "images": [], "type": "full-time"},
{"text": "AV Associate Engineer", "date": "2020-01-17 07:38", "compensation": "--PerYear", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-av-associate-engineer/7057655582.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "AV Field Engineer", "date": "2020-01-17 07:41", "compensation": "--PerYear", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-av-field-engineer/7057656189.html", "address": ["\n        ", "\n", "    "], "images": [], "type": "full-time"},
{"text": "Experienced Architect/Drafter", "date": "2020-01-17 10:17", "compensation": "Commensurate upon experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-experienced-architect-drafter/7057731846.html", "address": ["\n        ", "\nWe are looking for an experienced architect who can handle a busy, fast-paced but exciting work environment.", "\n", "\nMust have knowledge of NYC Zoning and Building Codes as well as liaising with DOB Examiners for plan approvals and DOB experience in general.", "\n", "\nMust have a positive attitude, strong work ethic, and a firm understanding of architectural drafting and procedures. Must be an organized and dedicated individual who will become a integral and valued member of our team!", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Experienced Architect/Drafter", "date": "2020-01-17 10:23", "compensation": "Commensurate upon experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-experienced-architect-drafter/7057735724.html", "address": ["\n        ", "\nWe are looking for an experienced architect who can handle a busy, fast-paced but exciting work environment.", "\n", "\nMust have knowledge of NYC Zoning and Building Codes as well as liaising with DOB Examiners for plan approvals and DOB experience in general.", "\n", "\nMust have a positive attitude, strong work ethic, and a firm understanding of architectural drafting and procedures. Must be an organized and dedicated individual who will become a integral and valued member of our team!    "], "images": [], "type": "full-time"},
{"text": "PROJECT MANAGER", "date": "2020-01-17 10:52", "compensation": "130K to 145K with yearly bionus based n results; excellent benefit package", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager/7057756761.html", "address": ["\n        ", "\nThis Group, leader in the hi-end Packaging industry for BEAUTY /COSMETIC/PERFUMES , with 20000 employees in the World  is looking to hire as soon as possible a PROJECT MANAGER/CUSTOMER DEVELOPMENT -for its Prestige Product category-  who will be responsible for designing  and directing the activities of custom development projects for Key Global Customers.  ", "\nThis project manager will work closely with clients in product design, development, refinement and customization for their new product launches.", "\nWe are looking for a candidate with engineering background (or several years experience in Engineering department) and several years in Project Management.", "\nand some knowledge of the Packaging industry", "\n", "\nOther Requirements:", "\no\tBachelor degree in engineering disciplines preferred.", "\no\tAt least 5 year  experience in project management  with direct customer interface in leadership roles,•\tSkills", "\no\tPro-E/Creo Software - preferred", "\no\tFluent oral and written English", "\no\tFluent oral and written French - preferred", "\no\tFluent computer operation skills", "\no\tTraining and experience in project management.", "\no\tDemonstrated effective communication and leadership skills.", "\n\tAbility to work effectively with minimal supervision.", "\nPosition might be based either in NYC, Westchester, Connecticut or New Jersey", "\n", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Construction Project Manager / Project Manager / Const. Superintendent", "date": "2020-01-17 10:54", "compensation": "Very competitive salary together with generous bonus on completion of projects.", "link": "https://newyork.craigslist.org/brk/egr/d/new-york-construction-project-manager/7057758260.html", "address": ["\n        ", "\nConstruction Project Manager/ Construction Project Manager / Construction Superintendent", "\n", "\nFast growing, dynamic concrete construction company seeks a number of project managers for work in the New York City area.", "\n", "\nCandidates should possess a thorough knowledge of the construction process and be computer literate. Duties will include supervising a large staff and scheduling work in an efficient manner to ensure compliance with clients’ requirements.  Understanding blueprints and shop drawing together with submittals is a prerequisite. Work includes excavation, shoring, and concrete from foundation all the way up to roof.  Duties will include all the functions normally associated with project management on jobs from five to fifty floors high.  Knowledge of New York City and FDNY codes and requirements is required. ", "\n", "\nSuccessful candidates will be joining a successful team and will receive support to help him/her succeed in a very fast moving environment. ", "\n", "\nVery competitive salary together with generous bonus on completion of projects.", "\n", "\nWe are an equal opportunity employer.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architecture Project Manager", "date": "2020-01-17 11:10", "compensation": "Salary will be commensurate with the level of experience.", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architecture-project-manager/7057770577.html", "address": ["\n        ", "\nWe’re looking for a full-time architecture project manager to join our small team of easygoing, talented and hardworking designers and architects. This is a creative role that requires someone with a passion for design and an innovative vision. The role will also rely heavily on performance in a fast-paced environment, both individually and managerially. If you're familiar with our work and excited to join our team and create with us, we'd love to hear from you. ", "\n", "\nHere’s a bit more about who we’re looking for…", "\n• Bachelor’s or Master's Degree in Architecture", "\n• 5+ years of experience in project management. Must be ready to oversee and manage six or more simultaneous projects of varying sizes", "\n• 5+ years of experience in NYC producing full construction document sets in AutoCAD ", "\n• This position communicates directly with firm principals and clients. Candidate must be presentable and possess excellent communication skills, grammar, and vocabulary (both written and verbal)", "\n• Must be highly proficient in creating/modifying architectural documents, designs, working drawings, forms, charts and records in AutoCAD", "\n• This position will be responsible for ensuring all construction-related deliverables are in alignment with our overall design intent and coordinated between all parties throughout the course of any given project. ", "\n• Experience in leveling bids, and communicating directly with contractors, subcontractors, and consultants", "\n• Must be able to acquire and assemble the information needed to finish architectural drawings, and make shop and site visits as needed", "\n• Must be proficient in specification book creation and sourcing of new and innovative materials including plumbing, hardware, wall, ceiling and floor finishes, etc. ", "\n• This position will require some travel to job sites outside of NYC. Must have a valid US driver's license, car ownership is a plus.", "\n• Availability to start immediately and work full-time, Monday through Friday, 9 AM to 6 PM", "\n", "\nIf all of the above sounds like you, we’d love to meet you and discuss the possibility of working together. Please send an introduction and tell us why you’d make a great addition to our team. Please include your resume as well as examples of your work in PDF format. Salary will be commensurate with the level of experience.", "\n", "\nThanks, we're looking forward to hearing from you!    "], "images": [], "type": "full-time"},
{"text": "ARCHITECT Senior/ Intermediate", "date": "2020-01-17 13:19", "compensation": "$20-$30 based on experience/knowledge", "link": "https://newyork.craigslist.org/que/egr/d/bayside-architect-senior-intermediate/7057881026.html", "address": ["\n        ", "\nMin. proven 3 year architectural drawing experience ", "\nProduce Drawings using autocad,", "\nMust Understand NYC zoning regulation/ bldg code, ", "\n", "\nLegal documents for employment in US.", "\nBA/BS in Architecture required.", "\n", "\nEnglish Communication skill req'd.", "\nFull time, Cover letter with Expected Salary.    "], "images": [], "type": "full-time"},
{"text": "Career Opportunities in Engineering for Immigrant Professionals", "date": "2020-01-17 11:37", "compensation": "Free Courses with Job Placement Assistant", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-career-opportunities-in/7057792523.html", "address": ["\n        ", "\nThe Cooper Union Retraining Program for Immigrant Engineers at CAMBA assists highly skilled immigrant professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering. Courses are scheduled around the needs of working professionals and offered evenings and weekends. ", "\nSince its inception in 1987, the Retraining Program helped connect more than 5,000 immigrant professionals to science, technology and engineering jobs. ", "\n", "\nALL SERVICES ARE FREE", "\nClasses include:", "\n", "\nOSHA 30", "\nGreen Building Guidelines & Environmental Safety", "\nBuilding Operation, Maintenance & Safety Regulation", "\nHeating, Ventilation, Air-Condition and Safety Regulation (HVAC)", "\nNational Electrical Code (NEC) and Its Applications", "\nAISC Structural Steel Design", "\nACI Structural Concrete Design", "\nIntroduction to AutoCAD for Engineers", "\nAdvanced AutoCAD and Revit", "\nBuilding Cost Estimating and Bridge, Highway, Railroad Engineering", "\n", "\nTo be considered for the program applicants must:", "\n", "\n•Be born outside of the United States", "\n•Be authorized to work in the United States", "\n•Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not in US)", "\n•Have lived in the U.S. less than five full years. (Exceptions for those in the U.S. more than five years may be made on a case-by-case basis)", "\n•Be unemployed, underemployed, or working in a field not related to your education", "\n•Have intermediate+ English fluency", "\n•Demonstrate a financial need", "\n•Be highly motivated to pursue professional job search", "\n", "\nPlease, visit our web site: www.cooper.edu/immigrant-retraining   - for application instructions and for more information call 718-226-0437.", "\n    "], "images": [], "type": "full-time"},
{"text": "Engineering/Architectural CAD Operator", "date": "2020-01-17 13:06", "compensation": "Hourly", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-engineering-architectural/7057870003.html", "address": ["\n        ", "\nEngineering/Architectural firm looking for a part/full time employee seasoned in CAD. Preparation and development of construction drawings. Preparation and development of DOB drawings. Searching for a career minded individual willing to learn and acquire experience. Designer/ CAD Operator, will be responsible for generating and revising high quality construction documents (utilizing CAD) for HVAC,Electrical and Plumbing Systems.", "\nThis position requires a good working knowledge of AutoCAD/AutoCAD MEP; and the ability to interpret mechanical, electrical, plumbing and fire protection drawings. Working directly with the design engineers and architects, this is a great opportunity to learn and develop skills, prepare technical drawings and construction documents.", "\n    "], "images": [], "type": "full-time"},
{"text": "General Contractor - Estimator Wanted Immediately", "date": "2020-01-17 13:37", "compensation": "Compensation varies depending on experience", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-general-contractor/7057897320.html", "address": ["\n        ", "\nWe are searching for an estimator for our general contracting company. Our company works in the five boroughs of the city of New York and does only public work. We specialize in civil construction such as sewers, water mains, utilities, concrete, asphalt and site work. We work with agencies such as the Department of Design & Construction, Port Authority of New York & New Jersey, Department of Environmental Protection, School Construction Authority, Parks Department and others. ", "\n", "\nRequirements:", "\nEstimating experience", "\nBachelor degree", "\nExperience with unions and prevailing wage", "\nOrganized", "\nFluent in microsoft office, especially excel", "\nAbility to read drawings", "\nAbility to perform takeoffs and estimate quantities", "\nFamiliarity with the labor, materials and time needed to perform work", "\n", "\nAbility to drive to pre-bid meetings is a plus. ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Construction Estimator", "date": "2020-01-17 14:25", "compensation": "Competitive salary", "link": "https://newyork.craigslist.org/que/egr/d/construction-estimator/7057938072.html", "address": ["\n        ", "\nConstruction Estimator/Project Manager", "\n", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with minimum 10 years' experience to join our team.  ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural drawings, developing scope of work, preparing formal proposals, attend meetings and walk throughs, solicit bids from subcontractors and vendors, manage projects, cost control, submittals and scheduling. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and MS Project and possess strong analytical and communication skills with an eye for detail.", "\n", "\nBA/BS in architecture or engineering preferred.  Drawing, sketching and Auto CAD proficiency a plus.", "\n", "\nCompetitive salary and benefits package.", "\n    "], "images": [], "type": "full-time"},
{"text": "Architect, Intermediate", "date": "2020-01-17 14:52", "compensation": "Compensation is commensurate with candidate's qualifications, skills and experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-intermediate/7057960292.html", "address": ["\n        ", "\nWe are a rapidly expanding, nationally known, architecture / interior design firm specializing in high-end projects, both residential and commercial, with a unique emphasis on luxury, high-budgeted, one-family homes. The bulk of our architectural projects are located in New York City, Brooklyn, Long Island and Southern Jersey. We maintain offices in Lower Manhattan and in Brooklyn. ", "\n", "\nWe are currently seeking a highly qualified, experienced architect to join our firm. Applicants must be proficient in the production of comprehensive, detailed construction-documents and shop-drawings for mid-sized commercial and residential projects, including one-family, luxury homes, and must have extensive knowledge of building systems, means and methods for various types of construction projects. ", "\n", "\nExpertise in all of N.Y.C. zoning and code regulations and ADA compliance and experience in N.Y.C. DOB drawings and filings is a must.  Knowledge of international zoning and code regulations is a plus.  ", "\n", "\nApplicant must have excellent communication skills, capable of competently corresponding and interacting with professional consultants and with clients, must be a team player able to operate within a high-pressured, creative environment, and must be capable of concentrating on a variety of projects simultaneously and completing projects within a strict time-frame. ", "\n", "\nSince all of our projects require extremely high standards of design, we are looking for a talented professional who is  passionate about cutting-edge and innovative design, who has excellent architectural-design sensibilities, and who has expertise in various design styles with an updated knowledge of cutting-edge construction-related materials and methods. ", "\n", "\n\tApplicant's requirements:", "\n", "\n•\t Bachelor or Master degree in Architecture ", "\n•\t A minimum of 5 years of relevant architectural experience", "\n•\t Extreme proficiency with AutoCAD drawing   ", "\n•\t Experience in both mid-sized building projects and construction of exclusive, luxury homes ", "\n•\t Ability to produce intricate, detail-oriented sets of construction documents and shop drawings", "\n•\t Experience with site planning, zoning analysis, and code compliance.", "\n•\t Expertise in NYC zoning and code regulations and ADA compliance requirements ", "\n•\t Experience with NYC DOB filing procedures and regulations ", "\n•\t Strong creative/design talents and excellent graphic-presentation skills  ", "\n•\t Strong oral and written communication skills   ", "\n•\t Ability to work within a team and to supervise junior staff", "\n•\t Proficiency with 3D Modeling and graphic platforms and software is a plus", "\n", "\nWe are offering benefits after a three month trial period, with industry standard paid vacation, holidays and personal days off. ", "\n", "\nCompensation is commensurate with candidate's qualifications, skills and experience", "\n", "\nTo apply, please email your CV together with samples of your work to the email address provided.", "\n    "], "images": [], "type": "full-time"},
{"text": "Engineer - Architect - Inspector", "date": "2020-01-17 15:12", "compensation": "generous hourly rate; 1.5 for OT", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-engineer-architect-inspector/7057976104.html", "address": ["\n        ", "\nURGENT NEED!  We are about to begin a six month project to inspect state facilities.  Individuals who have experience performing condition assessments.  Prior experience would be helpful.  Architects will inspect building envelope and interior spaces.  Electrical Engineers will inspect lighting and electrical circuits.  Mechanical Engineers will inspect HVAC, Plumbing and Fire Protection systems.  Civil Engineers will inspect civil/structural components. Please contact Alexandra, Josh or Bob!    "], "images": [], "type": "contract"},
{"text": "Electrical Engineer", "date": "2020-01-17 15:23", "compensation": "salary with generous benefit package commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-electrical-engineer/7057984592.html", "address": ["\n        ", "\nIMMEDIATE NEED!  Electrical Engineers - permanent job opportunities for MEP consulting firm! 5+ years experience.  Lighting design, engineering and specifications. Wiring diagrams, risers, security and fire alarms. Having an EIT, a big plus!  Knowledge of NYC building codes.  AutoCAD and computer proficient. Reach out to Josh, Alexandra or Bob today!    "], "images": [], "type": "full-time"},
{"text": "Superintendent - Construction", "date": "2020-01-17 15:48", "compensation": "salary with generous benefit package commensurate with experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-superintendent-construction/7058003819.html", "address": ["\n        ", "\nIMMEDIATE NEED!  Our client is seeking an Assistant Superintendent, Superintendent and Project Managers.  Brooklyn neighborhoods.  Ground-up and renovations.  Architects and MEP Engineers/Mechanical contractors.  Ability to coordinate with all contractors on general conditions work.  Coordinate and direct the daily activities of the contractors and trades.  Must be able to examine drawings and specifications. Contact Josh, Alexandra or Bob today!    "], "images": [], "type": "full-time"},
{"text": "Interior Designer", "date": "2020-01-17 17:01", "compensation": "This role offers a salary based on experience and a rich benefits package with inclusion in the company’s profit sharing, 401k, medical, and dental programs.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-interior-designer/7058057923.html", "address": ["\n        ", "\nAmuneal is looking to add an experienced interior designer to our team. This multi-faceted role will collaborate with our in-house Sales and Design team and clients at our NYC showroom to:", "\n•\tReview clients’ plans to identify opportunities for our products and product offerings.", "\n•\tProvide our clients with design options and pricing for Amuneal fabricated products and offerings based on the needs of their space.", "\n•\tCollaborate with our Clients to develop bespoke furniture and architectural elements to support and expand their projects.", "\n•\tDevelop new product and furniture offerings.", "\n•\tSupport the on-going design needs within our showroom and each of our facilities.", "\n", "\nCandidates must have experience in high-end design and must be proficient in conveying design ideas through hand-sketching and software. In addition to creating design options and layouts, the role will be integral to developing and revising pricing, documenting our scope of work through written proposals and working through the details of each project with our engineers, project managers and fabrication team.", "\n", "\nThe role is NYC based, but will include travel between our NYC showroom and our Philadelphia fabrication facility, as required, to support our customers and our internal teams.", "\n", "\nRequired Skills + Traits:", "\nClean Design Aesthetic: Ability to translate conversations into designs aligned with Amuneal’s aesthetic and product quality.", "\nStrong Social Skills and Professionalism: Be articulate, creative, energetic, disciplined, and flexible while communicating with clients directly and representing the Amuneal brand.", "\nProblem Solve: Solutions to problems aren’t always apparent: must be able to think creatively and develop solutions to challenges relating to design/fabrication as well as sales initiatives. Draw actionable insights from meetings and conversations.", "\nPassionate Learning: Must be eager to learn about Amuneal’s history, projects, and processes.", "\nComprehension of Basic Construction Principles: Blocking, wiring, field tolerances, logistics, etc.", "\nDiligence: Dedication to stay on top of projects and push them forward to meet deadlines.", "\nSelf-motivation/Initiative:  Take ownership of projects.", "\nTime Management:  Manage your own time and work under pressure on several simultaneous project with a clear timeline of completion.", "\n", "\nPlease submit cover letter, resume and at least 5 examples of relevant work including 1 hand drawn sample.", "\n", "\nPlease be sure to include your full name and the position you are applying for in your email subject.", "\n    "], "images": [], "type": "full-time"},
{"text": "In-house Interior Designer", "date": "2020-01-17 17:04", "compensation": "This role offers a salary based on experience and a rich benefits package with inclusion in the company’s profit sharing, 401k, medical, and dental programs.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-in-house-interior-designer/7058060220.html", "address": ["\n        ", "\nAmuneal is looking to add an experienced interior designer to our team. This multi-faceted role will collaborate with our CEO, our Senior Design Consultant and our in-house Sales and Design team to:", "\n•\tProvide our clients with bespoke configurations of our current product offerings based on the needs of their space.", "\n•\tCollaborate with our Clients to develop bespoke furniture and architectural elements to complement and expand their projects.", "\n•\tDevelop new product and furniture offerings.", "\n•\tSupport the on-going design needs within our showroom and each of our facilities.", "\n", "\nCandidates must have experience in high-end design and proficiency conveying design ideas through hand-sketching and software. In addition to creating design options and layouts, this role will be integral to developing and revising pricing, documenting our scope of work through written proposals and working through the details of each project with our engineers, project managers, and fabrication team.", "\n", "\nThe role can be based in either NYC or Philadelphia, but will include travel between the two, as required, to support our customers and our internal teams.", "\n", "\nRequired Skills + Traits:", "\nClean Design Aesthetic: Ability to translate conversations into designs aligned with Amuneal’s aesthetic and product quality.", "\nStrong Social Skills and Professionalism: Be articulate, creative, energetic, disciplined, and flexible while communicating with clients directly and representing the Amuneal brand.", "\nProblem Solve: Solutions to problems aren’t always apparent: must be able to think creatively and develop solutions to challenges relating to design/fabrication as well as sales initiatives. Draw actionable insights from meetings and conversations.", "\nPassionate Learning: Must be eager to learn about Amuneal’s history, projects, and processes.", "\nComprehension of Basic Construction Principles: Blocking, wiring, field tolerances, logistics, etc.", "\nDiligence: Dedication to stay on top of projects and push them forward to meet deadlines.", "\nSelf-motivation/Initiative:  Take ownership of projects.", "\nTime Management:  Manage your own time and work under pressure on several simultaneous project with a clear timeline of completion.", "\n", "\nPlease submit cover letter, resume and at least 5 examples of relevant work including 1 hand drawn sample.", "\n", "\nPlease be sure to include your full name and the position you are applying for in your email subject.    "], "images": [], "type": "full-time"},
{"text": "Project Manager Assistant  / Office Manager Assistant", "date": "2020-01-17 17:08", "compensation": "Compensation", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-project-manager-assistant/7058063076.html", "address": ["\n        ", "\n", "\n", "\nWe are Currently looking for a Project Managers Assistant and Office Manager Assistant with Experience ", "\n", "\nOffice Manager Assistant  Experience Requirements: ", "\n ", "\n * Looking for a FEMALE    ", "\n * Microsoft Office ", "\n * Customer Service & Sales ", "\n * Billing & Bookkeeping ", "\n * Online Researching and Advertising ", "\n * Appointment Scheduling", "\n * Multi Language Russian or Spanish is a plus but not required..", "\n", "\nProject Manager Assistant Experience Requirements:", "\n", "\n * Looking for a MALE ", "\n * Minimum Construction Experience 4 years", "\n * Ability to read construction drawings", "\n * Knowledge and experience in estimating ", "\n * Ability to provide Daily safety orientation ", "\n * Daily Construction Reports ", "\n * 30 Hours OSHA", "\n * Clean Driving Record - No Felonies  ", "\n", "\nPlease email your resume and we will certainly get back to you:", "\n", "\nOffice Phone:  (718) 489-9405     Please DO NOT CALL if you don't match our requirements listed above.. ", "\n ", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Construction Plans Estimator", "date": "2020-01-17 21:54", "compensation": "Salary: $15.00 to $20.00 /hour", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-construction-plans-estimator/7058209698.html", "address": ["\n        ", "\nHere at Energy Spray Systems, we are looking for an individual who has a basic familiarity with thermal envelope systems and is responsible for appropriately evaluating insulation and waterproofing materials used for given projects as provided by plans, specifications, and/or communication with our clients, builders, and architects. You will become familiar with our competitive advantages as an organization and will be able to communicate those to our benefit throughout the bidding process of both residential and commercial project. ", "\n", "\nResponsibilities", "\n•\tPreparing detailed and accurate insulation project takeoffs and estimates.", "\n•\tReading and understanding plan drawings and specifications and interfacing with general contractors and architects.", "\n•\tProposing and negotiating innovative and cost-saving solutions to our clients.", "\n•\tUnderstanding project goals, deadlines and revising estimates as necessary throughout the bidding process.", "\n•\tMaintaining knowledge of prior experience and new competitive advantages in the industry to aid in the bidding process.", "\n•\tObtaining up to date and accurate prices for thermal system materials. ", "\n", "\n", "\nRequirements and Qualifications", "\n•\tMust be able to work on-site at our office in Stamford. ", "\n•\t1 – 3 years of construction or architecture experience; insulation/waterproofing systems experience preferred.", "\n•\tBasic knowledge of insulation and waterproofing products. ", "\n•\tProficiency in Microsoft Office software.", "\n•\tKnowledge and experience using construction estimating software preferred; for example, Bluebeam Revu. ", "\n•\tStrong blueprint/plan-reading skills.", "\n•\tSolid understanding of basic mathematical principles", "\n•\tStable work history.", "\n•\tHighly organized and detail oriented. ", "\n•\tStrong problem-solving skills.", "\n•\tExcellent time management skills, with adherence to milestones and deadlines.", "\n•\tAbility to handle large amounts of data entry and analysis.", "\n    "], "images": [], "type": "full-time"},
{"text": "Facade / Building Envelope Project Manager", "date": "2020-01-17 17:22", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project-manager/7058072439.html", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer or architect with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us as a Project Manager  in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "], "images": [], "type": "full-time"},
{"text": "Drafter/Estimator Experienced in steel fabrication", "date": "2020-01-18 12:07", "compensation": "25", "link": "https://newyork.craigslist.org/que/egr/d/flushing-drafter-estimator-experienced/7058453556.html", "address": ["\n        ", "\nWe are seeking an in house person experienced in steel fabrication to detail our incoming jobs and do takeoffs for bidding on projects as well.Must be somewhat experienced. Please reply in detail for interview,thanks.    "], "images": [], "type": "full-time"},
{"text": "Facade / Building Envelope Architect or Engineer", "date": "2020-01-17 17:30", "compensation": "Commensurate with experience", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect-or/7058077980.html", "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to exterior restoration of buildings and infrastructure, is seeking Architects and Engineers to help execute a growing slate of challenging projects. We’re currently considering candidates for a range of roles, from entry-level to 10 or more years of building-envelope experience. ", " \nWe offer the resources of a large firm with the collaborative culture of a smaller studio, plus access to industry-leading technology and an in-house non-destructive testing lab.\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio.", "\n    "], "images": [], "type": "full-time"},
{"text": "Top Architectural Metal  + Glass Company looking for drafter/engineer!", "date": "2020-01-18 08:31", "compensation": "Negotiable, 401K, Profit Sharing.", "link": "https://newyork.craigslist.org/que/egr/d/woodside-top-architectural-metal-glass/7058321558.html", "address": ["\n        ", "\nWe are one of the top architectural metal and glass fabrication and installation companies in New York.  We work with fortune 500 company clients and the top architects in the city.  We are looking for an engineer that is proficient in CAD, understand construction processes and architectural details.  We are willing to train the right person.  You are self motivated, a problem solver and can work out vague details into something that can be built.   Join our team and enjoy a long term career opportunity, competitive pay and benefits.  Please send your resume along with some sample of your CAD work (the more detailed the better).    "], "images": ["https://images.craigslist.org/00M0M_8HIHzDOZRoT_600x450.jpg", "https://images.craigslist.org/00E0E_iVW1qK80rHj_600x450.jpg", "https://images.craigslist.org/01212_lOsSLJpoeZ3_600x450.jpg", "https://images.craigslist.org/00L0L_kAn5VHdl9Bd_600x450.jpg"], "type": "full-time"},
{"text": "SPANISH SPEAKING NAIL STYLIST NEEDED  (MANICURES&PEDICURES)", "date": "2020-01-19 17:12", "compensation": "Based on experience. Compensation will be discussed during interview.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-spanish-speaking-nail/7059197113.html", "address": ["\n        ", "\nLooking for a nail stylist that can do Manicures, pedicures and acrylic nails. ", "\nSpanish speaking/bilingual preferred. ", "\nLocation: Castle Beauty Spa", "\n4931 Broadway, NY, NY 10034", "\nPlease call me to setup an interview. ", "\nEstrella  - 347-920-9042", "\n", "\nSe solicita tecnica en acrilico y personal para manicure y pedicure. Para trabajo de tiempo completo. ", "\nEn: Castle Beauty Spa", "\n4931 Broadway, NY, NY 10034", "\n", "\nPara mas informacion llame: Estrella  - 347-920-9042    "], "images": [], "type": "full-time"},
{"text": "Millwork Estimator", "date": "2020-01-19 20:44", "compensation": "$50,000-$70,000/year depending on experience", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-millwork-estimator/7059296582.html", "address": ["\n        ", "\nSelect NYC Millwork is a high-end millwork and furniture producer in New York City. We are looking for a qualified analytical millwork estimator to join the team. The job entails preparing detailed bid proposals from project plans & specifications. The candidate should be proficient in reading project plans and shop drawings, be highly motivated, detail-oriented and proficient communication. ", "\n", "\nResponsibilities", "\n", "\n1.\tRead, analyze, calculate, interpret, and understand architectural drawings and specification documents.", "\n2.\tReview drawings and specifications to determine the scope of work", "\n3.\tGenerate material take-off lists and costs ", "\n4.\tObtain bids from vendors on specialty items", "\n5.\tPrepare job quotes/bids on company’s template ", "\n6.\tFollow up on bids as necessary to monitor our pricing compared to our competitors.", "\n7.\tTrack quotes in CRM software ", "\n8.\tCommunicate with the client including sending the quote, RFIs, and follow ups. ", "\n9.\tSelf-motivation with the ability to work unsupervised", "\n10.\tBe familiar with cabinet construction and drawing requirements to adhere to the industry's governing bodies (AWI, QCP, LEED, FSC, etc.)", "\n", "\nExperience Requirements:", "\n", "\n1.\tEstimating: 5 years ", "\n2.\tMillwork: 3 years ", "\n3.\tComputer experience in excel, word, outlook, CAD", "\n4.\tKnowledge of woodworking construction techniques", "\n5.\tExcellent communication skills", "\n6.\tAble to meet deadlines.", "\n7.\tBachelor’s Degree in Engineering/ Math or similar preferred", "\n8.\tTake-off software skills is a plus", "\n9.\tCNC knowledge", "\n", "\n", "\n", "\n", "\n", "\n    "], "images": ["https://images.craigslist.org/01515_5ANAKsywpFS_600x450.jpg", "https://images.craigslist.org/00K0K_dPHNA0PDW5s_600x450.jpg", "https://images.craigslist.org/00J0J_dFejp3mp6Oj_600x450.jpg", "https://images.craigslist.org/00H0H_42BFtg2VMea_600x450.jpg", "https://images.craigslist.org/00w0w_cEukSkZ6EOe_600x450.jpg"], "type": "full-time"},
{"text": "Millwork Engineer / CNC Programmer", "date": "2020-01-19 21:36", "compensation": "$60K-$85K", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-millwork-engineer-cnc/7059316143.html", "address": ["\n        ", "\nMillwork Engineer / CNC Programmer ", "\n", "\nSelect NYC Millwork is a high-end millwork and furniture producer in New York City. We are looking for an analytical and knowledgeable millwork Engineer to join the team. The job entails interpreting and engineering production drawings for production and installation teams. The candidate should have extensive knowledge of millwork construction and production methods and techniques with an excellent skillset of the design software.  ", "\n", "\nResponsibilities", "\n", "\n1.\tRead, analyze, calculate, interpret, and understand architectural drawings and specification documents.", "\n2.\tPrepare production ready shop drawings with exact construction and specification details.", "\n3.\tValue engineer the project ensuring optimal use of materials, construction methodology, manufacturing and installation to achieve design intent. ", "\n4.\tModifying customers design for functionality and structural integrity", "\n5.\tCommunicate with the client to approve shop drawings and present the plan to the production team. ", "\n6.\tPrepare CNC programs per the project requirements", "\n7.\tWork independently to move drawings and CNC operations ahead without supervision", "\n8.\tOperate CNC router if/when necessary", "\n9.\tMaintain organized CAD files/folders as required", "\n", "\n", "\nExperience Requirements:", "\n", "\n1.\tMillwork production: 10 years ", "\n2.\tManufacturing industry experience: 7 years ", "\n3.\tExceptional knowledge of woodworking construction techniques and methods", "\n4.\tExcellent knowledge of materials, lighting, fixtures, and hardware.", "\n5.\tAutoCAD, Microvellum, Cabinet Vision, Cut Rite, BlueBeam and/or Alpha Cam experience preferred", "\n6.\tComputer experience in Excel and Word. ", "\n7.\tHigh level of commercial construction blueprint reading skills preferred", "\n8.\tProficient in programming millwork, casework, and retail fixture parts.", "\n9.\tBackground in millwork and furniture engineering, ", "\n10.\tProficient knowledge in CNC programming for wood, solid surface and acrylic applications", "\n11.\tBachelor’s Degree in Engineering/ Math or similar preferred", "\n12.\tAble to multi-task and meet strict deadlines", "\n13.\tExcellent communication skills", "\n14.\tMust read, write, and speak English", "\n15.\tSelf-motivation with the ability to work unsupervised", "\n16.\tBe familiar with millwork construction and drawing requirements to adhere to the industry's governing bodies (AWI, QCP, LEED, FSC, etc.)", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "], "images": ["https://images.craigslist.org/00Y0Y_3EVoEcfPdeG_600x450.jpg", "https://images.craigslist.org/00H0H_fWRcI8xgOyl_600x450.jpg", "https://images.craigslist.org/00w0w_cEukSkZ6EOe_600x450.jpg", "https://images.craigslist.org/01515_5ANAKsywpFS_600x450.jpg", "https://images.craigslist.org/00J0J_dFejp3mp6Oj_600x450.jpg"], "type": "full-time"},
{"text": "Surveyor layout", "date": "2020-01-20 15:40", "compensation": "Very competitive salary together with generous bonus on completion of projects.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-surveyor-layout/7059769762.html", "address": ["\n        ", "\nSurveyor layout", "\n", "\nFast Growing Contractor in NY metropolitan area looking for a survey/layout man.", "\nWork includes excavation, foundations, SOE, and concrete superstructures.", "\n", "\nResponsibilities are as follows ( But Are Not Limited To)", "\n", "\n•\tProficient in current surveying techniques using different types of total stations, data collectors, GPS Equipment and Robotic Instruments.", "\n•\tAbility to use surveying and CAD software.", "\n•\tPerforms boundary, topographic, utilities surveying and construction stake out.", "\n•\tHolds level or stadia rod at designated points to assist in determining elevations and laying out stakes.", "\n•\tCalls out reading or writes station number and reading in notebook.", "\n•\tMarks points of measurement with elevation, station number, or other identifying mark.", "\n•\tMeasures distance between survey points with steel tape, cloth tape or electronic instruments.", "\n•\tMarks measuring points with keel (marking crayon), paint sticks, scratches, tacks, or stakes.", "\n•\tPlaces stakes at designated points and drives them into ground at specified elevation.", "\n•\tPerforms other duties as required.", "\n•\tOperates survey instruments virtually every day with little or no supervision, while striving to increase speed and accuracy.", "\n•\tMakes field book notes and sketches of data gathered at job site.", "\n•\tPrepares as-built drawings as required. ", "\n", "\n", "\nRequirements", "\n", "\n•\tBachelor's degree preferred but not required.", "\n•\tMinimum of 5 year of related experience.", "\n•\tAbility to use surveying and CAD software.", "\n•\tExperience with boundary, topographic, utilities surveying and construction stake out.", "\n•\tCarry layout up through superstructure floors.", "\n•\tMust have a valid New York or New Jersey Driver's License.", "\nExcellent salary for right candidate with bonus opportunities. ", "\nWe are an affirmative action/equal opportunity employer.", "\n  ", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Concrete Safety Manager", "date": "2020-01-20 15:54", "compensation": "Very competitive salary together with generous bonus on completion of projects.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-concrete-safety-manager/7059780845.html", "address": ["\n        ", "\nConcrete Safety Manager ", "\n", "\nResponsibilities", "\nConduct training and presentations for health and safety matters and accident prevention to workmen", "\n•\tMonitor compliance to policies and laws by inspecting employees, their certifications and operations", "\n•\tInspect equipment and machinery to observe possible unsafe conditions", "\n•\tInvestigate accidents or incidents and prepare reports.", "\n•\tRecommend solutions to issues, improvement opportunities or new prevention measure", "\n•\tReport on health and safety awareness, issues and statistics", "\n•\tExcellent organizational and motivational skills", "\n•\tOutstanding attention to detail and observation ability", "\n•\tExceptional communication and interpersonal abilities plus an ability to enforce rules.", "\n•\tKeep records and daily reports.", "\n", "\nREQUIREMENTS", "\n", "\nProven experience as a concrete safety manager with NYC DOB registration  AND OSHA CERTIFICATION. ", "\n", "\nKnowledge of FDNY regulations as they pertain to construction sites.", "\nDeep understanding of legal health and safety guidelines and ability to enforce rules and regulations as required.", "\n", "\nAbility in producing reports and developing relevant policies", "\n", "\nKnowledge of standards and regulations for safeguarding and maintaining a construction site to ensure work is carried out in a safe manner.", "\n", "\nKnowledge of the standards and regulations related to fall protection, types of protection and related safety equipment.", "\n", "\nKnowledge of regulation related to Traffic Controls and Pedestrian Safety Knowledge of standards and regulations related to Fire Prevention.", "\n", "\nKnowledge of Standards and regulations related to OSHA concrete Subpart Q.", "\n", "\nKnowledge of standards and regulations related to the use of Cranes and Derricks as related to concrete operations.", "\n", "\n", "\nWe are a fast growing concrete construction company with room for advancement,  Competitive pay and opportunities for bonuses.", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Revit Operator - Part or Full Time", "date": "2020-01-20 14:41", "compensation": "Hourly depending on skill level", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-revit-operator-part-or-full/7059720832.html", "address": ["\n        ", "\nWe seek IMMEDIATE help with a skilled Revit user for documentation on a single-family house. This is a posting only for experienced Revit users.", "\n", "\nWork can last as short as one month, full-time, with potential to transition to permanent full-time depending on performance. ", "\n", "\nApplicants must demonstrate complete mastery of Revit, including the following tasks:", "\n- General documentation;", "\n- Building all types of families from scratch;", "\n- Modeling of sophisticated geometries in a way that permits them to be documented.", "\n", "\nWhile architecture experience is not a requirement, it is a benefit.", "\n", "\nPlease forward a resume and a PDF that includes past Revit work. Particularly attention will be given to applicants who can show construction documents from Revit.    "], "images": [], "type": "contract"},
{"text": "Entry-Level Junior Estimator", "date": "2020-01-21 11:32", "compensation": "$35,000-40,000/yr", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-entry-level-junior-estimator/7060229417.html", "address": ["\n        ", "\n", "\n", "\nWe are the seller of high-end window & doors for residential and commercial projects throughout the NY Metro/Northeast area.  Our sales office is located on the Upper East Side, with manufacturing operations located in numerous locations throughout Europe and South America. We sell various product lines, including thermally-broken steel, stainless steel, bronze and aluminum as well as wood (mahogany) and wood/aluminum clad.  All of our projects are custom made to order based on the customer’s needs.  ", "\n", "\nWe are a small company that is growing quickly, and looking to find an entry level employee to help out and learn so they can eventually transition into a more important role.", "\n", "\n", "\n", "\n-  Interpret architectural drawings to create a project takeoff to be sent to manufacturers for pricing", "\n-  Find leads using verified techniques to feed the sales team", "\n", "\n", "\n", "\n", "\n-  Salary, computer, expense reimbursement & health insurance", "\n-  Role will eventually transition into a promotion to project management or sales", "\n", "\n", "\n", "\n", "\n-  Strong knowledge of computers and software.  Programs will include Excel, Podio & basic PDF software.  Occasional use of an AutoCAD reader (no drafting).  We will teach each program to the right candidate, but experience in any of these is a plus.  ", "\n", "\n-  Strong attention to detail.  You will be reviewing documents with lots of information on them, so being able to pick up on patterns and spot irregularities is a must.", "\n", "\n-  Ability to read architectural drawings a plus", "\n", "\n-  Willing to learn:  we will train the right candidate over the first 6 months, but during this time you will also need to learn independently in your free time to get up to speed as quickly as possible.", "\n", "\n-  Strong communication skills.  You will be collaborating with other engineers and will need to describe issues, resolutions, updates and requirements in a clear manner.", "\n", "\n-  Bachelor’s degree in any technical field preferred, but not required.  A field relating to architecture, construction or engineering would be ideal.", "\n", "\n-  Work experience in construction, architecture or engineering-related field preferred, but not required.   ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Architect", "date": "2020-01-21 11:39", "compensation": "competitive salary based on experience + benefits + PTO", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/7060234870.html", "address": ["\n        ", "\nWell-known architecture and interiors practice, seeks intermediate level staff (5+ years) to join its New York office. This person will be exposed to a range of work, including but not limited to: retail, corporate and hospitality projects. ", "\n", "\nWill work on a team, but must be able to complete sections of work with a fair amount of autonomy, producing high quality design development drawings in Revit and CAD.", "\n", "\nInterested parties should have 5+ years experience working in a professional architectural setting. Must be able to show a quality set of DD or CD drawings and have exposure to built projects.    "], "images": [], "type": "full-time"},
{"text": "Assistant Estimator", "date": "2020-01-20 15:42", "compensation": "Very competitive salary together with generous bonus on completion of projects.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-estimator/7059770895.html", "address": ["\n        ", "\nAssistant Estimator ", "\n", "\nThe goal is to provide detailed take-offs to enable accurate estimates,", "\n", "\nResponsibilities:", "\n", "\n•\tPrepare accurate estimates for concrete frame buildings including excavation, shoring and foundations.", "\n•\tCheck specifications and submit RFI’s to Client.", "\n•\tUse estimating software as well as Excel for preparing take-offs off blueprints", "\n•\tCreate and submit estimate reports or bids to Senior Estimator.", "\n•\tObtain and review offers and quotes by subcontractors or vendors", "\n•\tBuild relationships with key vendors (subcontractors, suppliers, GC's etc.)", "\n•\tExpedite submittals for architect approval", "\n•\tProvide consultation on planning (schedules, material lists, needs etc.)", "\n•\tConduct research to obtain data on material costs, production times etc.", "\n•\tUnderstand the project/program and its requirements", "\n•\tDetermine key variables for cost and other estimates", "\n•\tAssist Foreman/Project Manager in the project process to help make the project move smoothly and efficiently", "\n", "\n", "\nPosition Qualifications:", "\n", "\n•\tMust have experience with engineering and architectural drawings", "\n•\tIn depth knowledge of research and data analysis methods and estimation formulas", "\n•\tExquisite math and computer knowledge with an analytical mindset", "\n•\tProficient in relevant software (Microsoft Excel, Estimating Software)", "\n", "\n", "\n We are a fast growing concrete contractor with opportunities for growth and we offer competitive salary and bonus system", "\n•\t", "\n", "\n", "\n    "], "images": [], "type": "full-time"},
{"text": "Project Manager", "date": "2020-01-21 18:11", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/7060539697.html", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an ambitious, positive and long term oriented individual with a minimum 4 years experience as a Project Manager in an Architectural Woodworking Company.", "\nRequirements: Excellent knowledge of technology and materials, work under pressure and high managerial skills. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills. Only candidates from the trade please apply.", "\nPlease email your resume, references and salary expectations.    "], "images": [], "type": "full-time"},
{"text": "Estimator", "date": "2020-01-21 18:16", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/estimator/7060542538.html", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an experienced, ambitious, positive and long term oriented individual.", "\nRequirements:", "\nExcellent knowledge of wood technology and materials. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.    "], "images": [], "type": "full-time"},
{"text": "Draftsman, Assistant Project Manager", "date": "2020-01-21 18:12", "compensation": "TBD", "link": "https://newyork.craigslist.org/que/egr/d/draftsman-assistant-project-manager/7060540255.html", "address": ["\n        ", "\nA reputable Architectural Woodworking Company is looking for a full time draftsman/assistant project manager position. Only solid, professional and long term oriented please apply. This position requires excellent knowledge of AUTOCAD. Only experienced in the field apply. Please email your resume, references and salary expectations    "], "images": [], "type": "full-time"},
{"text": "High End Kitchen Designer", "date": "2020-01-17 16:57", "compensation": "This role offers a salary based on experience and a rich benefits package with inclusion in the company’s profit sharing, 401k, medical, and dental programs.", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-high-end-kitchen-designer/7058054892.html", "address": ["\n        ", "\nAmuneal is looking to add an experienced kitchen designer to our team. This role will collaborate with our in-house Sales and Design team to work with our clients in developing highly customized kitchens, bars and various installations for their projects. ", "\n", "\nSupported by our current and ever-growing designs and our NYC Showroom, this role is envisioned to be both pragmatic and creative, delivering layouts based on years of functional experience within an overall design that feels bespoke to each project.", "\n", "\nCandidates must have experience in high-end kitchen design and must be proficient in conveying design ideas through hand-sketching and software. In addition to creating design options and layouts, the role will be integral to developing and revising pricing, documenting our scope of work through written proposals and working through the details of each project with our engineers, project managers and fabrication team.", "\n", "\nThe role can be based in either NYC or Philadelphia, but will include travel between the two locations, as required, to support our customers and our internal teams.", "\n", "\nRequired Skills + Traits", "\nClean Design Aesthetic: Ability to translate conversations into designs aligned with Amuneal’s aesthetic and product quality.", "\nStrong Social Skills and Professionalism: Be articulate, creative, energetic, disciplined, and flexible while communicating with clients directly and representing the Amuneal brand.", "\nProblem Solve: Solutions to problems aren’t always apparent: must be able to think creatively and develop solutions to challenges relating to design/fabrication as well as sales initiatives. Draw actionable insights from meetings and conversations.", "\nPassionate Learning: Must be eager to learn about Amuneal’s history, projects, and processes.", "\nComprehension of Basic Construction Principles: Blocking, wiring, field tolerances, logistics, etc.", "\nDiligence: Dedication to stay on top of projects and push them forward to meet deadlines.", "\nSelf-motivation/Initiative: Take ownership of projects.", "\nTime Management: Manage your own time and work under pressure on several simultaneous project with a clear timeline of completion.", "\n", "\nPlease submit cover letter, resume and at least 5 examples of relevant work including 1 hand drawn sample.", "\n", "\nPlease be sure to include your full name and the position you are applying for in your email subject.", "\n    "], "images": [], "type": "full-time"}
]